{
    "version": "https://jsonfeed.org/version/1",
    "title": "Webs",
    "description": "",
    "home_page_url": "https://gabrielgenri.github.io/ProyectoWebs",
    "feed_url": "https://gabrielgenri.github.io/ProyectoWebs/feed.json",
    "user_comment": "",
    "author": {
        "name": "Gabriel Genri"
    },
    "items": [
        {
            "id": "https://gabrielgenri.github.io/ProyectoWebs/anulaciones-de-temas.html",
            "url": "https://gabrielgenri.github.io/ProyectoWebs/anulaciones-de-temas.html",
            "title": "Anulaciones de temas",
            "summary": "Antes de entrar en el tema \"¿Cómo?\" y \"¿Por qué?\", ​​deberíamos familiarizarnos&hellip;",
            "content_html": "<header>\n<p class=\"post__title\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Antes de entrar en el tema \"¿Cómo?\" y \"¿Por qué?\", ​​deberíamos familiarizarnos con los conceptos básicos sobre la estructura de temas de Publii, ya que esto nos ayudará a ver más claramente los beneficios de las modificaciones. Si has revisado un poco los archivos de tu sitio web de Publii (es mucho más fácil hacerlo con las opciones de ubicación de archivos del sitio web que se agregaron en la </span><a href=\"https://getpublii.com/blog/publii-beta-3.html\" target=\"_blank\" rel=\"noopener noreferrer\" style=\"font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">versión Beta 3 de Publii</a><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> ), es posible que hayas visto que hay varios tipos de archivos que se incluyen en la creación de un tema:</span></p>\n</header>\n<div class=\"post__entry\">\n<ul>\n<li><strong>Archivos .hbs</strong> : para que los temas de nuestra aplicación sean más fáciles de entender, se crean con Handlebars, que funciona junto con HTML para crear la estructura de un tema. Esto hace que el código del tema sea más comprensible para los principiantes sin sacrificar la flexibilidad para las personas con un poco más de experiencia.</li>\n<li><strong>Archivos .css</strong> : Handlebars nos brinda la estructura, pero es CSS el que nos brinda el estilo. El código CSS se utiliza para establecer la posición de los elementos, darles color, forma y estilo; todo lo que le da carácter a un tema.</li>\n<li><strong>Archivos .js</strong> : Javascript es la columna vertebral de las funciones más complejas que encontrará en la web moderna; si está interactuando con un sitio web más allá de completar formularios y hacer clic en enlaces, entonces Javascript probablemente esté detrás de ello.</li>\n<li><strong>Archivos .json</strong> : los archivos JSON son, básicamente, archivos de texto que se utilizan para almacenar datos; se utilizan en los temas de Publii para almacenar configuraciones, traducciones de temas y similares.</li>\n</ul>\n<p>Es posible que te encuentres con algunos tipos de archivos más, pero los que se mencionaron anteriormente son, con diferencia, los más comunes y esenciales. Ahora que sabemos qué tipo de archivos hay en los temas, podemos echar un vistazo a lo que pueden hacer las modificaciones.</p>\n<h2 id=\"whatarethemefileoverrides\">¿Qué son las anulaciones de archivos de tema?</h2>\n<p>Como vimos en la última sección, cada parte de un tema determinado está controlada por un tipo de archivo en particular; entonces, ¿qué sucede si queremos realizar cambios en el estilo base o agregar algunos elementos nuevos a la estructura? La respuesta lógica aquí es que puedes usar los archivos existentes; ¿necesitas cambiar el estilo? Abre el archivo CSS correcto y agrega los cambios. Este método funcionará, pero no pasará mucho tiempo hasta que te topes con algunos problemas.</p>\n<p>El mayor problema son las actualizaciones. Digamos que agregas tu propio código a uno de los archivos de tema. Una vez que se lanza una actualización de ese tema, hay una buena posibilidad de que el archivo modificado sea reemplazado durante el proceso de actualización, lo que lo revierte al valor predeterminado y elimina cualquier cambio que hayas agregado antes. Luego está el problema del seguimiento de los cambios. Con tantos archivos que componen un tema, puede ser fácil olvidar exactamente qué archivo se ha modificado con nuestro propio código. Este problema se agrava aún más si varias personas trabajan en el proyecto de forma independiente.</p>\n<p>Las anulaciones brindan una solución a ambos problemas, ya que permiten a los usuarios de Publii crear archivos de anulación, que son esencialmente copias de los archivos de tema existentes que se almacenan por separado y que \"anularán\" o reemplazarán el archivo original. En pocas palabras, cuando Publii crea el diseño de la página utilizando los archivos de tema, verificará si hay archivos en la ubicación de anulación y reemplazará los archivos de tema existentes con estas anulaciones.</p>\n<p>Al crear una ubicación separada para los archivos de modificación, es posible realizar un seguimiento exacto de los archivos que se han modificado y mantener una ubicación central que no cambie para insertar su propio código en un tema. Y como Publii ignora las carpetas de modificación excepto cuando se crea el sitio web, podrá mantener una copia de seguridad de sus modificaciones incluso durante las actualizaciones de la aplicación. De esta manera, puede aplicar su propio código a un tema sin el riesgo de perder los cambios en las actualizaciones o tener problemas para realizar un seguimiento de los archivos que se han modificado.</p>\n<h2 id=\"howtouseoverridefiles\">Cómo utilizar archivos de anulación</h2>\n<p>Crear archivos de anulación es muy sencillo; solo siga estos pasos:</p>\n<ol>\n<li>Localice el directorio de temas de su sitio web; este estará en la ruta especificada en la opción <strong>Ubicación del sitio en su </strong><strong>Configuración global</strong> de Publii ; por defecto será <strong>C:\\Users\\yourUserName\\Documents\\Publii\\sites</strong> .</li>\n<li>Dentro de este directorio verás carpetas para cada uno de tus sitios web de Publii; cada sitio web puede tener sus propias modificaciones, así que abre la carpeta del sitio que deseas cambiar. Verás tres carpetas: <strong>input</strong> , <strong>output</strong> y <strong>preview</strong> ; la carpeta themes estará en la carpeta <strong>input</strong> , así que ábrela y, por último, abre la carpeta <strong>themes</strong> ; esta contiene los temas actualmente instalados para el sitio web elegido.</li>\n<li>Ahora necesitamos encontrar la carpeta que contiene el tema para el que queremos crear una anulación y anotar el nombre de la carpeta del tema. Luego, necesitaremos crear una nueva carpeta en el directorio de temas, pero nómbrala <strong>themeName-override</strong> ; por ejemplo, si quisieras modificar el tema Simple, que está en una carpeta llamada <strong>simple</strong> , entonces crearías una carpeta llamada <strong>simple-override</strong> en el directorio de temas de tu carpeta de entrada, por ejemplo  <strong>Documents\\Publii\\sites\\your-siteName\\input\\themes</strong>\n<pre><code>- simple-override\n  |- index.hbs</code></pre>\n</li>\n<li>¡Ahora estás listo para comenzar a sobrescribir archivos! Puedes sobrescribir prácticamente cualquier archivo del tema simplemente creando una copia en tu nuevo directorio de sobreescritura; copia y pega el archivo desde la ubicación del tema original en la carpeta de sobreescritura; si el archivo original estaba en una subcarpeta de los archivos del tema, entonces la copia de sobreescritura también debería colocarse en una carpeta con el mismo nombre. Por ejemplo, si quisiéramos sobrescribir el archivo <strong>main.css , que está en la carpeta </strong><strong>themeName\\assets\\css</strong> , entonces necesitaríamos crear una carpeta <strong>assets</strong> en nuestro directorio <strong>themeName-override , luego crear un directorio </strong><strong>css</strong> dentro de ese y, finalmente, crear una copia del archivo <strong>main.css</strong> en la carpeta <strong>css</strong> .</li>\n<li>Una vez hecho esto, Publii utilizará el archivo copiado en el directorio de reemplazo para crear el sitio web en lugar del archivo original, por lo que puede comenzar a agregar su propio código al archivo según sea necesario. Recuerde que solo debe agregar los archivos que desea reemplazar en la carpeta de reemplazo; si no se encuentra un archivo en particular en la carpeta de reemplazo, se utilizará automáticamente el archivo original.</li>\n</ol>\n<h2 id=\"importantpointstoremember\">Puntos importantes para recordar</h2>\n<p>Anular archivos es un proceso muy sencillo como vimos en la sección anterior, pero hay algunas cosas importantes a tener en cuenta al utilizar esta función:</p>\n<ul>\n<li>Si desea anular el archivo <strong>language.json</strong> , es recomendable utilizar el directorio <strong>de idiomas</strong> , ya que esto fusionará el archivo de anulación con el archivo original; puede encontrar detalles sobre cómo hacer esto en nuestra <a href=\"https://getpublii.com/blog/translate-publii-theme-to-another-language.html\" target=\"_blank\" rel=\"noopener noreferrer\">Guía de traducción de temas de Publii</a> .</li>\n<li>Si desea crear un archivo .hbs vacío en el directorio, asegúrese de que contenga al menos un espacio en blanco; si el archivo se deja completamente vacío, recibirá un error al intentar crear su sitio web.</li>\n<li>La versión anulada de su tema no aparecerá en la lista de temas en la configuración básica, solo será visible la versión original del tema.</li>\n<li>El nombre del tema reemplazado no se puede cambiar respecto al original, pero puedes modificar las opciones de configuración.</li>\n<li>Es posible agregar ayudantes adicionales a través del archivo <strong>helpers.js</strong> si es necesario; esto incluye ayudantes que no estaban en la versión original del tema.</li>\n<li>Actualmente, el archivo <strong>miniatura.png</strong> del tema no se puede anular, ya que solo se usa en la pantalla de configuración de la aplicación, donde solo son visibles los archivos del directorio del tema original.</li>\n<li>Si desea insertar archivos adicionales al tema, colóquelos en el directorio de <strong>activos</strong> .</li>\n</ul>\n<p>Con eso en mente, ya estás listo para comenzar; ¡diviértete agregando tus propios toques personales a los temas que encuentres en Publii, y si tienes alguna pregunta sobre la guía anterior, no dudes en contactarnos en los comentarios a continuación!</p>\n</div>",
            "author": {
                "name": "Gabriel Genri"
            },
            "tags": [
                   "Publii"
            ],
            "date_published": "2024-11-10T01:25:06-03:00",
            "date_modified": "2024-11-10T01:29:14-03:00"
        },
        {
            "id": "https://gabrielgenri.github.io/ProyectoWebs/mejorar-los-temas-con-fuentes-cargadas-localmente.html",
            "url": "https://gabrielgenri.github.io/ProyectoWebs/mejorar-los-temas-con-fuentes-cargadas-localmente.html",
            "title": "Mejorar los temas con fuentes cargadas localmente",
            "summary": "Mejorar los temas con fuentes cargadas localmente Los temas son lo que&hellip;",
            "content_html": "<h2><span>Mejorar los temas con fuentes cargadas localmente</span></h2>\n<p><span>Los temas son lo que realmente hace que su sitio web se destaque, por lo que es importante que sigamos presentando nuevas funciones de temas para que realmente destaquen. En esta versión, la característica destacada de los temas, además de la incorporación de compatibilidad con comentarios a través de complementos, es la nueva función </span><strong><span>DynamicAssets</span></strong><span> agregada para desarrolladores que cambia por completo la forma en que Publii maneja las fuentes. Entonces, ¿qué significa eso para nuestros usuarios?</span></p>\n<figure class=\"post__image post__image--wide shadow\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/73/fonts-loaded-locally-2.webp\" alt=\"Fuentes de Google cargadas localmente\" width=\"2160\" height=\"733\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<p><span>Las versiones anteriores de Publii utilizaban fuentes de Google preseleccionadas, que ofrecían algunas opciones interesantes, pero no siempre eran la solución de carga más rápida. Además, dado que el almacenamiento en caché de recursos en sitios y dominios ya no funciona, no podemos confiar en que los usuarios ya tengan las fuentes elegidas en la memoria caché de su navegador; siempre será necesario descargar los archivos de fuentes cuando visite su sitio por primera vez, lo que aumenta el tiempo de carga.</span></p>\n<p><span>Ahora, con esta nueva función, Publii incluye un conjunto de más de </span><strong><span>40 fuentes variables</span></strong><span> para que nuestros usuarios elijan, y solo las fuentes especificadas se implementarán en el servidor. Esto significa que nuestra solución de fuentes ahora </span><strong><span>cumple al 100 % con el RGPD,</span></strong><span> ya que las fuentes se cargan directamente desde su servidor en lugar de una CDN de terceros, y tiene enormes beneficios en los resultados de velocidad de la página (cerca de 100/100).</span></p>\n<figure class=\"post__image post__image--wide shadow\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/73/page-speed.webp\" alt=\"Velocidad de la página de las fuentes de Google cargadas localmente\" width=\"2160\" height=\"1030\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<p><span>Si quieres saber todos los detalles de esta nueva función, puedes consultar nuestro artículo sobre las fuentes Publii aquí: </span><a href=\"https://getpublii.com/docs/fonts.html\" target=\"_blank\" rel=\"noopener noreferrer\"><span>https://getpublii.com/docs/fonts.html</span></a></p>\n<p><span>Este cambio también trae consigo algunas otras novedades interesantes. Se pueden elegir dos fuentes y asignarlas a los encabezados, el contenido del cuerpo, el logotipo y el menú de forma individual. Como alternativa, también se puede asignar una tercera opción llamada </span><strong><span>system-ui</span></strong><span> , que utiliza la fuente base asignada al navegador del usuario.</span></p>\n<figure class=\"post__image post__image--wide shadow\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/73/font-options-2.webp\" alt=\"Opciones de fuente\" width=\"2160\" height=\"873\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<p><span>Otro beneficio de las fuentes variables es que </span><strong><span>solo es necesario cargar un único archivo de fuente</span></strong><span> para cada fuente, en lugar de archivos separados para las versiones normal y negrita de la fuente. Y como son variables, puedes </span><strong><span>usar cualquier grosor de fuente en todo el rango,</span></strong><span> es decir, en lugar de solo un grosor normal, como 400 para la versión normal, y un grosor mayor, como 600 para la versión negrita, puedes configurar cualquier grosor de fuente intermedio, como, por ejemplo, 478. Esto les da a nuestros usuarios un control muy específico sobre cómo se verá y se verá exactamente el contenido de su sitio en la página.</span></p>\n<figure class=\"post__image post__image--wide shadow\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/73/font-weight.webp\" alt=\"Peso de fuente en rango completo\" width=\"2160\" height=\"540\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<p><span>También hemos realizado algunas mejoras en los temas individuales que están disponibles para Publii; puedes leer un registro de cambios completo para cada tema en su página respectiva en el mercado, pero por ahora nos gustaría mencionar que </span><strong><span>el tema Simple ahora tiene un modo oscuro</span></strong><span> .</span></p>\n<figure class=\"post__image post__image--wide shadow\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/73/simle-dark-mode.webp\" alt=\"Tema simple con modo oscuro\" width=\"2160\" height=\"1541\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<h2><span>Otros cambios para los usuarios</span></h2>\n<p><span>Hay algunas otras novedades en esta versión de Publii que vale la pena mencionar:</span></p>\n<p><span>El </span><strong><span>protocolo \"dweb\"</span></strong><span> (que es \"dweb\" y no \"dweeb\", si es que usted es un producto de los años 80), se refiere a la \"Web distribuida\", es el protocolo utilizado por la \"Web distribuida\", que descentraliza la web y la distribuye a través de una red peer-to-peer. Con este soporte añadido, ahora puede seleccionar \"dweb\" como el protocolo para la dirección de su sitio web, si así lo desea.</span></p>\n<figure class=\"post__image post__image--wide shadow\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/73/dweb-protocol.webp\" alt=\"Protocolo Dweb\" width=\"2160\" height=\"1018\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<p><span>Al cambiar la ubicación de los sitios a través de la opción </span><strong><span>Ubicación de archivos</span></strong><span> , se agrega un botón para </span><strong><span>cambiar la ubicación de almacenamiento de los \"sitios\" sin copiar los archivos de los sitios existentes</span></strong><span> a la nueva ubicación; útil si desea comenzar de nuevo sin perder los archivos originales del sitio.</span></p>\n<figure class=\"post__image post__image--wide shadow\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/73/file-location.webp\" alt=\"Ubicación del archivo del sitio\" width=\"2160\" height=\"667\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<p><span>El administrador de archivos Publii ahora admite los formatos de imagen </span><strong><span>AVIF</span></strong><span> , </span><strong><span>webP y TIFF</span></strong><span>  .</span></p>\n<p><span>Finalmente, se ha agregado una nueva posición para su </span><strong><span>HTML personalizado</span></strong><span> ; </span><strong><span>@commentsCustomCode</span></strong><span> , que permite a los usuarios agregar código HTML personalizado al área donde se muestran los comentarios, ya sea utilizando su propia solución o una de las soluciones existentes proporcionadas por los complementos de Publii.</span></p>\n<figure class=\"post__image post__image--wide shadow\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/73/comments-custom-code.webp\" alt=\"Comentarios Código personalizado\" width=\"2160\" height=\"1016\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<p><br><span>La versión 0.39 también incluye una serie de mejoras específicamente para desarrolladores:</span></p>\n<h2><span>Vista previa avanzada</span></h2>\n<p><span>Se ha añadido una opción a la sección </span><strong><span>Configuración de la aplicación → Opciones para desarrolladores</span></strong><span> de Publii, </span><strong><span>Habilitar vista previa avanzada</span></strong><span> . Cuando está habilitada, al hacer clic en el botón </span><strong><span>Obtener vista previa de los cambios</span></strong><span> se mostrarán los archivos del sitio, pero no se abrirá el navegador para mostrar la vista previa.</span></p>\n<figure class=\"post__image post__image--wide shadow\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/73/preview-changes-2.webp\" alt=\"Habilitar vista previa avanzada\" width=\"2160\" height=\"1493\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<h2><span>Nuevas variables, ayudantes y opciones</span></h2>\n<p><span>Esta actualización incluye una serie de nuevas variables, ayudantes, etc. que ayudarán a los desarrolladores a aprovechar aún más sus sitios basados ​​en Publii:</span></p>\n<ul>\n<li><span>Se agregaron nuevas variables globales: </span><strong><span>@website.rootUrl</span></strong><span> , </span><strong><span>@website.mediaFileUrl</span></strong><span> , </span><strong><span>@website.tagsUrl</span></strong><span> y </span><strong><span>@website.baseUrl</span></strong><span> .</span></li>\n<li><span>Se agregaron nuevos ayudantes: </span><strong><span>getAuthor</span></strong><span> y </span><strong><span>getAuthors</span></strong><span> .</span></li>\n<li><span>Se agregó el nuevo ayudante </span><strong><span>'asset'</span></strong><span> , que devuelve rutas de activos.</span></li>\n<li><span>El banner de cookies de Publii ahora emite eventos personalizados para </span><strong><span>document.body</span></strong><span> , lo que permite que los complementos reaccionen a las acciones de consentimiento del usuario.</span></li>\n<li><span>Se agregó una nueva opción para temas, </span><strong><span>files.useDynamicAssets</span></strong><span> , y soporte para el nuevo archivo </span><strong><span>dynamic-assets-mapping.js</span></strong><span> , que permite a los desarrolladores de temas evitar implementar archivos incluidos con un tema.</span></li>\n</ul>\n<h2><span>Otras mejoras</span></h2>\n<p><span>Como siempre, no solo hay un montón de nuevas funciones; también hemos realizado pequeñas mejoras en varias áreas para que Publii sea más fácil de usar que nunca. A continuación, puede encontrar una lista completa de estas incorporaciones:</span></p>\n<ul>\n<li><span>Se modificó el comportamiento de implementación manual; los archivos ahora se guardan en un directorio separado (por ejemplo, [SITENAME]-files) en lugar de borrar la URL de destino.</span></li>\n<li><span>Detección mejorada de directorios de sitios faltantes.</span></li>\n<li><span>Se mejoraron los indicadores para los procesos de creación de copias de seguridad y duplicación de sitios, para que sean más claros de entender.</span></li>\n<li><span>Detección mejorada de títulos de publicaciones vacías.</span></li>\n<li><span>Se permite el uso de </span><strong><span>postConfig</span></strong><span> y </span><strong><span>themeConfig</span></strong><span> con los archivos </span><strong><span>visual-overrides.js</span></strong><span> y </span><strong><span>theme.variables.js</span></strong><span> .</span></li>\n<li><span>Se permitió que el asistente de fecha devolviera texto sin formato.</span></li>\n<li><span>La regeneración de miniaturas ahora se puede cancelar a través de la configuración del sitio.</span></li>\n<li><span>Mejor manejo de clases CSS en galerías.</span></li>\n<li><span>Se mejoró el comportamiento de la información sobre herramientas en el editor de bloques al crear un nuevo bloque.</span></li>\n<li><span>Se mejoró el manejo de los parámetros de filas/columnas para el campo de área de texto que se configuran en las opciones.</span></li>\n<li><span>Se fusionó el editor de bloques con el núcleo de Publii.</span></li>\n<li><span>Se actualizaron varias dependencias.</span></li>\n<li><span>Electron actualizado a 17.*</span></li>\n<li><span>Mejoras generales del código.</span></li>\n</ul>\n<h2><span>Corrección de errores</span></h2>\n<p><span>Errores. No podemos vivir con ellos, no podemos vivir con ellos. Por eso, hemos hecho un esfuerzo para eliminar varios errores que nuestros usuarios han informado. A continuación, se incluye una lista completa:</span></p>\n<ul>\n<li><span>Se solucionó el problema con el cambio de ubicación de los sitios.</span></li>\n<li><span>Se solucionó el problema con la incrustación de imágenes en el editor Markdown.</span></li>\n<li><span>Se corrigieron problemas con el editor de bloques.</span></li>\n<li><span>Se solucionó el problema al usar varias cuentas de Netlify.</span></li>\n<li><span>Se solucionó el problema al utilizar el generador de tabla de contenido en el editor de bloques.</span></li>\n<li><span>Se solucionó el problema de promesas no manejadas al usar SFTP.</span></li>\n<li><span>Se solucionó el problema con el comportamiento de la lista de etiquetas en los listados de etiquetas.</span></li>\n<li><span>Se solucionó el problema con la compresión CSS que causaba que algunos selectores CSS se rompieran.</span></li>\n<li><span>Se solucionó el problema con la barra de desplazamiento en el editor Markdown.</span></li>\n<li><span>Se corrigieron inconsistencias en la función 'Leer más'.</span></li>\n<li><span>Se solucionó un problema que ocurría con la compatibilidad con certificados SSL.</span></li>\n<li><span>Se solucionó el problema con los datos del autor faltantes en JSON-LD.</span></li>\n<li><span>Se solucionó el problema con las casillas de verificación en el administrador de menú al eliminar elementos en masa.</span></li>\n<li><span>Se solucionó el problema con los archivos de puntos faltantes al implementar manualmente.</span></li>\n</ul>\n<p><span>Ha sido un largo camino hasta esta actualización, pero esperamos que los frutos de nuestro trabajo sean suficientes. Nos gustaría agradecer a nuestra comunidad por su paciencia y apoyo; con su orientación, podemos mejorar Publii y convertirla en una aplicación verdaderamente fácil de usar, estable y versátil. Esperamos ofrecer más actualizaciones excelentes en el futuro; asegúrese de estar atento, ya que lanzaremos varios complementos durante el próximo año y finalizaremos la API del complemento para que quede perfecto.</span></p>\n<p><span>Mientras tanto, si quieres seguir el desarrollo, puedes visitar </span><a href=\"https://github.com/GetPublii/Publii\" target=\"_blank\" rel=\"nofollow noopener\"><span>la página de GitHub</span></a><span> de Publii . Y si tienes alguna pregunta, necesitas ayuda con la aplicación o quieres informar un error o sugerir una función que te gustaría ver en el futuro, visita los </span><a href=\"https://forum.getpublii.com/\" target=\"_blank\" rel=\"nofollow noopener\"><span>foros de Publii</span></a><span> y háznoslo saber.</span></p>",
            "author": {
                "name": "Gabriel Genri"
            },
            "tags": [
                   "Publii"
            ],
            "date_published": "2024-11-10T01:22:13-03:00",
            "date_modified": "2024-11-10T01:22:13-03:00"
        },
        {
            "id": "https://gabrielgenri.github.io/ProyectoWebs/ahora-es-posible-traducir-temas.html",
            "url": "https://gabrielgenri.github.io/ProyectoWebs/ahora-es-posible-traducir-temas.html",
            "title": "Ahora es posible traducir temas",
            "summary": "¡Nuevo tema de Portfolio ideal para la pasarela! Nuestro último lanzamiento de&hellip;",
            "content_html": "<h2><span>¡Nuevo tema de Portfolio ideal para la pasarela!</span></h2>\n<p><span>Nuestro último lanzamiento de tema ofrece un estilo increíblemente elegante que es perfecto para personas creativas que priorizan lo visual. El enfoque principal de este tema son las fotos y las imágenes, y cada aspecto del diseño del tema ayudará a mostrar su trabajo de fotografía o diseño.</span></p>\n<p><span>Dado que el nuevo tema está centrado en los portafolios, la página principal evita simplemente enumerar grandes grupos de vistas previas de artículos; en su lugar, una presentación de diapositivas en la página principal permite a los usuarios moverse entre las vistas previas de cada publicación mediante la rueda de desplazamiento, el tacto o las teclas de flecha, y cada vista previa ocupa todo el espacio de la pantalla para que cada imagen sea el centro de atención. Este tema también cuenta con dos diseños de etiquetas para mostrar sus publicaciones que son perfectos para portafolios: un diseño de cuadrícula estándar o un diseño de triple imagen que es un poco menos uniforme.</span></p>\n<figure class=\"post__image undefined\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/9/portfolio-theme.jpg\" alt=\"Tema de portafolio para Publii\" width=\"832\" height=\"581\" loading=\"lazy\" data-is-external-image=\"true\"></figure>\n<figcaption><span>Nuevo tema de cartera: </span><a href=\"https://marketplace.getpublii.com/product/portfolio/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>demostración en vivo</span></a></figcaption>\n</figure>\n<p><span>Las opciones de personalización de este tema son amplias para satisfacer las necesidades de los diseñadores; define tamaños de imágenes en las vistas previas, expande o contrae los bordes entre imágenes y aprovecha las nuevas opciones de publicación para establecer qué elementos adicionales, como una biografía, aparecen en tus publicaciones. Sin embargo, el contenido de texto no se ignora; las adiciones tipográficas especiales incluyen texto descentrado que se puede desplazar hacia la izquierda desde la columna de texto central, lo que se ve muy bien con citas, así como texto de introducción que se destaca al comienzo de la publicación.</span></p>\n<p><span>Entonces, si te gusta la fotografía, el diseño visual, el arte o la arquitectura, el tema Portfolio es una de las mejores formas de mostrar tu trabajo en un diseño distintivo y hermoso sin sacrificar la velocidad de carga.</span></p>\n<h2><span>Se agregó compatibilidad con AWS S3</span></h2>\n<p><span>El mundo está más interconectado que nunca y esto se demuestra en el crecimiento del almacenamiento en la nube. Desde usuarios individuales que guardan sus fotos hasta grandes empresas que ejecutan sus aplicaciones multipropósito en grandes clústeres de servidores que permiten a sus empleados conectarse desde cualquier parte del mundo, la nube parece haber llegado para quedarse. En esta versión de Publii, se ha agregado compatibilidad con una de las soluciones en la nube más populares, AWS S3 de Amazon, lo que proporciona una opción alternativa de alojamiento y almacenamiento para su sitio web estático.</span></p>\n<figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/9/amazon-s3.png\" alt=\"Publii es compatible con Amazon S3\" width=\"1031\" height=\"850\" loading=\"lazy\" data-is-external-image=\"true\"></figure>\n<h2><span>Realice una copia de seguridad y restaure los archivos de su sitio web</span></h2>\n<p><span>Perder su trabajo no es ninguna broma; después de pasar cientos de horas perfeccionando su sitio web y produciendo contenido que le encantará a su audiencia, la idea de perderlo todo por una caída del servidor no merece la pena.</span></p>\n<p><span>Publii ya era un poco más fácil de mantener seguro que otras herramientas de sitios web estáticos; al ser una aplicación local, los archivos siempre estaban en tu computadora y en tu servidor. Sin embargo, siempre hay lugar para mejorar, y la tercera versión beta incluye una nueva función de copia de seguridad y restauración para una mayor tranquilidad.</span></p>\n<figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/9/backup.png\" alt=\"Opción de copia de seguridad del sitio web de Publii\" width=\"832\" height=\"300\" loading=\"lazy\" data-is-external-image=\"true\"></figure>\n<p><span>En el menú principal de Publii, verás que hay una nueva opción: </span><strong><span>Copias de seguridad</span></strong><span> . En esta área puedes crear instantáneamente una copia de seguridad de tu sitio web actual con un solo clic en el botón </span><strong><span>Crear copia de seguridad</span></strong><span> ; el archivo recién creado se agregará a la lista de copias de seguridad disponibles junto con información adicional útil, como la fecha de creación y el tamaño del archivo. Cuando quieras restaurar tu sitio web a partir de una copia de seguridad, solo tienes que hacer clic en el botón </span><strong><span>Restaurar</span></strong><span> junto a la copia de seguridad que deseas cargar en las listas; solo recuerda que restaurar a partir de una copia de seguridad sobrescribirá todos tus archivos, así que si no has hecho una copia de seguridad de ninguna publicación que quieras conservar, ¡asegúrate de hacerlo primero!</span></p>\n<p><span>Por supuesto, probablemente haya otra pregunta que realmente necesite respuesta: ¿dónde se almacenan sus copias de seguridad? Al igual que los archivos de sitios web locales, se ha agregado una nueva opción a la </span><strong><span>Configuración global</span></strong><span> llamada </span><strong><span>Ubicación de copias de seguridad</span></strong><span> , donde puede definir la ruta donde se deben guardar sus copias de seguridad, lo que facilita guardarlos en su DropBox, OneDrive u otra carpeta de almacenamiento en la nube para una mayor seguridad en caso de desastre.</span></p>\n<h2><span>Obtén control total sobre el diseño de tus publicaciones</span></h2>\n<p><span>La parte clave de cualquier publicación que hagas será el contenido; sin contenido atractivo que sea relevante para tu audiencia, no conseguirás visitas. Sin embargo, esto no significa que no debas prestar atención a otras áreas; echa un vistazo a casi cualquier artículo de cualquier sitio web popular y verás una multitud de oportunidades de participación, como comentarios, biografías de autores, opciones para compartir en redes sociales y similares, que contribuyen a ayudar al sitio a establecer una identidad y comenzar a expandirse por la web.</span></p>\n<figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/9/post-options.png\" alt=\"Opciones de diseño de publicaciones\" width=\"832\" height=\"782\" loading=\"lazy\" data-is-external-image=\"true\"></figure>\n<p><span>Pero no todas las publicaciones necesitan todos los extras posibles. Por este motivo, la última versión beta de Publii incluye compatibilidad con temas para agregar opciones de publicación personalizadas, que encontrará en el área </span><strong><span>de Configuración personalizada</span></strong><span> para todos los temas integrados de Publii. Aquí puede decidir si desea mostrar extras como botones de redes sociales, nombre del autor, navegación y etiquetas de publicaciones, y mucho más. Además de las configuraciones globales que se aplican a todas las publicaciones, también puede anular individualmente las configuraciones globales en cada publicación a través de la pantalla Editar publicación, por lo que si agregó una publicación informativa simple que no necesita todos los extras habituales, puede configurarla con facilidad.</span></p>\n<h2><span>Establezca la ubicación de los archivos de su sitio web local</span></h2>\n<p><span>Cada uno tiene su propia forma de hacer las cosas cuando se trata de administrar archivos; algunas personas simplemente dejan las ubicaciones predeterminadas cada vez que instalan una aplicación, mientras que otras tienen estructuras de carpetas meticulosas que las ayudan a estar al tanto de sus archivos; es seguro decir que esta nueva característica es específicamente para el último tipo.</span></p>\n<figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/9/files-location.png\" alt=\"Ubicación de los archivos del sitio web local\" width=\"832\" height=\"242\" loading=\"lazy\" data-is-external-image=\"true\"></figure>\n<p><span>Las versiones anteriores de Publii utilizaban ubicaciones de archivos predeterminadas para almacenar los archivos de los sitios web, colocando una carpeta Publii en la sección Documentos del sistema operativo. La versión beta 3 elimina esta restricción y agrega una nueva opción en la </span><em><span>sección Configuración</span></em><span> de la aplicación Publii que permite a los usuarios definir dónde se deben almacenar los archivos de los sitios web que crean con la aplicación en su computadora; perfecto para aquellos con un enfoque estructurado. Esta flexibilidad también significa que puede configurar fácilmente los archivos de su sitio web para que se guarden automáticamente en su servicio favorito basado en la nube, como </span><strong><span>Dropbox</span></strong><span> , lo que le brinda acceso a los archivos actualizados de su sitio web donde quiera que vaya, incluso si está trabajando en una computadora separada. </span></p>\n<h2><span>SFTP con soporte de claves agregado</span></h2>\n<p><span>A todos nos vendría bien un poco más de seguridad; dado que los sitios web creados con Publii son estáticos y la aplicación se ejecuta localmente, ya es mucho más seguro que el CMS promedio. Sin embargo, esto hace que sea aún más importante garantizar que las pocas vías potenciales de ataque sean lo más seguras posible.</span></p>\n<figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/9/publii-sftp-key.png\" alt=\"SFTP con claves\" width=\"871\" height=\"768\" loading=\"lazy\" data-is-external-image=\"true\"></figure>\n<p><span>Las versiones anteriores de Publii incluían compatibilidad con la carga a través del FTP estándar, que transfiere datos en texto sin formato, así como el SFTP más seguro, que cifra los datos enviados a través de la conexión para que no se puedan leer en tránsito. El uso de SFTP es una forma segura de proteger sus credenciales de FTP, pero la tercera versión beta de Publii incluye otra forma de aumentar aún más la seguridad: SFTP con claves.</span></p>\n<p><span>Si no estás muy familiarizado con el aspecto técnico del desarrollo web, probablemente te estés preguntando cuál es el beneficio de la compatibilidad con claves para las conexiones SFTP. La respuesta es que crea otra capa de seguridad que protege tus datos. La conexión FTP básica envía datos como texto, por lo que si el flujo de datos se intercepta de alguna manera, un pirata informático podría obtener información como nombres de usuario y contraseñas. SFTP </span><em><span>encripta</span></em><span> los datos antes de enviarlos; básicamente, codifica los datos para que no se puedan leer, los envía y luego los descifra cuando llegan al final de su recorrido, lo que evita que alguien que intercepte el flujo de datos obtenga información útil de ellos.</span></p>\n<p><span>Con el soporte de claves, los datos se cifran como con el SFTP estándar, pero la conexión también requerirá una clave privada especial que sea exclusiva de su sistema. Si alguna vez vio una película de espías, a menudo hay una escena en la que se requieren dos llaves para abrir una puerta de seguridad; el soporte de claves es algo similar, pero en formato digital; si el usuario no tiene una clave que coincida con la del servidor, los datos no se enviarán. Si tener la mejor forma de protección para su sitio web es una prioridad para usted, entonces el soporte de claves es justo lo que necesita.</span></p>\n<h2><span>Se agregó compatibilidad con plantillas a las páginas de etiquetas</span></h2>\n<p><span>Las plantillas son una excelente manera de diversificar tu contenido; el tema adecuado puede incluir múltiples diseños que puedes usar para tus publicaciones. Sin embargo, anteriormente las páginas de etiquetas no recibían mucha atención; las plantillas solo se podían crear para publicaciones de Publii. Esto se ha corregido en la versión beta 3, que incluye opciones para asignar plantillas de etiquetas en la pantalla de administración de etiquetas y soporte para agregar plantillas de etiquetas a los temas.</span></p>\n<figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/9/tags-template.png\" alt=\"Plantilla de etiqueta de publicación\" width=\"832\" height=\"476\" loading=\"lazy\" data-is-external-image=\"true\"></figure>\n<h2><span>Ahora es posible traducir temas</span></h2>\n<p><span>El inglés puede ser un idioma global, pero no todos los sitios web necesitan ser globales; a menudo, su sitio web estará dirigido a un grupo de usuarios de nicho o tratará exclusivamente con contenido orientado más localmente y que no necesita viajar. Si su audiencia no habla inglés, entonces le alegrará saber que los temas de Publii ahora incluyen un archivo de idioma para que pueda traducir fácilmente los elementos a su idioma local.</span></p>\n<figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/9/language-file.png\" alt=\"Localización de temas de Publii\" width=\"832\" height=\"784\" loading=\"lazy\" data-is-external-image=\"true\"></figure>\n<p><span>El archivo de idioma que puedes modificar es un json que se puede encontrar en la carpeta del tema principal, con un nombre de archivo similar a 'themeName.lang.json', por ejemplo, si estás usando el tema Mercury, entonces el archivo de idioma será 'mercury.lang.json', y está en la carpeta </span><strong><span>themes→mercury en la ubicación de los archivos de tu sitio Publii.</span></strong></p>\n<h2><span>Configuración básica de visualización de publicaciones más flexible</span></h2>\n<p><span>Hemos añadido compatibilidad con ceros y menos unos a la configuración básica de las publicaciones de Publii. Sabemos que esto no suena especialmente interesante en el papel, pero mejora algunas de las funciones básicas de Publii. Una de las opciones más básicas que puedes cambiar es la cantidad de publicaciones por página, ya sea en la página del autor, en una etiqueta o en una lista de la página principal. Sin embargo, antes las únicas opciones eran mostrar una cantidad definida de publicaciones o mostrar todas las publicaciones configurando la cantidad de publicaciones en \"0\".</span></p>\n<figure class=\"is-loaded\"><img  src=\"https://getpublii.com/blog/media/posts/9/basic-settings.png\" alt=\"Configuraciones básicas flexibles\" width=\"832\" height=\"368\" loading=\"lazy\" data-is-external-image=\"true\"></figure>\n<p><span>Desde un punto de vista informático, esta función tiene mucho sentido, pero no es muy intuitiva; sin mencionar el hecho de que a veces no querrás que se muestre ninguna publicación, como si solo quieres que la página de biografía del autor muestre información general sin enlaces a las publicaciones. En la versión beta 3, se modificaron estas configuraciones para que un \"0\" en cualquier configuración de \"publicaciones por página\" no muestre ninguna publicación, mientras que \"-1\" mostrará todas las publicaciones.</span></p>\n<h3><span>Un bonito conjunto de mejoras en la calidad de vida.</span></h3>\n<p><span>No todo son grandes novedades; la versión beta 3 de Publii también incluye un sólido conjunto de toques adicionales para que el uso diario de la aplicación sea más sencillo y fácil de usar, entre los que se incluyen:</span></p>\n<ul>\n<li><span>Enlaces AMP y canónicos mejorados.</span></li>\n<li><span>Se crearon mejores mensajes de error para la prueba de conexión para ayudar a identificar áreas problemáticas.</span></li>\n<li><span>Se implementó un registro mejorado para la implementación de FTP/SFTP.</span></li>\n<li><span>Se agregaron muchas mejoras menores al módulo de implementación.</span></li>\n<li><span>Estilo de código mejorado en elementos previos.</span></li>\n<li><span>Añade la capacidad de crear separadores con notas en las opciones del tema.</span></li>\n<li><span>Se agregaron mensajes de alerta cuando el usuario intenta probar la conexión al servidor sin completar todos los campos obligatorios.</span></li>\n<li><span>Temas actualizados para admitir las opciones de visualización de publicaciones y la nueva API de traducciones.</span></li>\n</ul>\n<h3><span>Aplastando insectos</span></h3>\n<p><span>A nadie le gustan los errores, por lo que le alegrará saber que nuestro equipo ha puesto mucho esfuerzo en solucionar una amplia gama de áreas problemáticas en esta versión, entre las que se incluyen:</span></p>\n<ul>\n<li><span>Se solucionó el problema que podía provocar un proceso de carga FTP bloqueado.</span></li>\n<li><span>Se solucionó el problema con las vistas previas de medios en el editor de publicaciones.</span></li>\n<li><span>Se solucionó el problema del elemento de menú \"Salir\" que no funcionaba en la barra de menú de la aplicación (MacOS).</span></li>\n<li><span>Se corrigió el recuento de publicaciones en las páginas de etiquetas.</span></li>\n<li><span>Se solucionó el fallo que se producía al cancelar la carga de FTP.</span></li>\n<li><span>Se corrigió la adición innecesaria de un atributo de clase vacío al agregar una imagen sin una clase especificada.</span></li>\n<li><span>Se solucionó el problema cuando el campo de clase no se configuraba durante la edición de una imagen dentro del elemento de figura.</span></li>\n<li><span>Se corrigieron problemas con el menú fijo en algunos temas.</span></li>\n</ul>\n<h3><span>Ayúdanos a mejorar Publii</span></h3>\n<p><span>Aún estamos en el proceso de agregar funciones y otras mejoras a Publii; ¡por eso es una versión beta, después de todo! Pero para asegurarnos de que sea la mejor aplicación posible, necesitamos tus comentarios. Ya sea que tengas una idea para una función que te gustaría ver, hayas encontrado algunos errores que quieres solucionar o simplemente necesites ayuda para familiarizarte con las amplias opciones de Publii, no dudes en visitar nuestra </span><a href=\"https://publii.ticksy.com/\" target=\"_blank\" rel=\"noopener noreferrer\"><span>página de soporte de la comunidad</span></a><span> y contarnos qué está pasando; ¡siempre agradecemos cada comentario que recibimos!</span></p>",
            "author": {
                "name": "Gabriel Genri"
            },
            "tags": [
                   "Publii"
            ],
            "date_published": "2024-11-10T01:15:54-03:00",
            "date_modified": "2024-11-10T01:15:54-03:00"
        },
        {
            "id": "https://gabrielgenri.github.io/ProyectoWebs/archivo-configjson-del-tema.html",
            "url": "https://gabrielgenri.github.io/ProyectoWebs/archivo-configjson-del-tema.html",
            "title": "Archivo config.json del tema",
            "summary": "El config.jsonarchivo desempeña un papel fundamental en la personalización del aspecto y&hellip;",
            "content_html": "<header>\n<p class=\"post__title\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">El </span><code style=\"font-weight: var(--font-weight-normal);\">config.json</code><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">archivo desempeña un papel fundamental en la personalización del aspecto y el funcionamiento del sitio web generado por Publii. Funciona como el centro de configuración principal para el renderizador de temas y determina varios aspectos de cómo se muestra el contenido.</span></p>\n</header>\n<div class=\"post__entry\">\n<p>Publii fusiona el archivo de configuración del tema con el predeterminado que se ve a continuación:</p>\n<div class=\"code-toolbar\">\n<pre class=\"language-json\" tabindex=\"0\"><code>{\n    \"postTemplates\": {},\n    \"tagTemplates\": {},\n    \"authorTemplates\": {},\n    \"menus\": {},\n    \"renderer\": {\n        \"relatedPostsNumber\": 5,\n        \"includeFeaturedInPosts\": true,\n        \"tagsIncludeFeaturedInPosts\": true,\n        \"authorsIncludeFeaturedInPosts\": true,\n        \"featuredPostsNumber\": 0,\n        \"tagsFeaturedPostsNumber\": 0,\n        \"authorsFeaturedPostsNumber\": 0,      \n        \"includeHandlebarsInHelpers\": false,\n        \"create404page\": false,\n        \"nameFor404page\": \"404.html\"\n    },\n    \"supportedFeatures\": {\n        \"authorImages\": true,\n        \"blockEditor\": true,\n        \"errorPage\": true,\n        \"searchPage\": true,\n        \"tagImages\": true,\n        \"tagsList\": true,\n        \"pages\": true\n    },\n    \"config\": [\n        {\n            \"name\": \"logo\",\n            \"label\": \"Website logo\",\n            \"value\": \"\",\n            \"type\": \"media\",\n            \"upload\": true\n        },\n        {\n            \"name\": \"postsPerPage\",\n            \"label\": \"Posts per page\",\n            \"value\": 5,\n            \"type\": \"number\"\n        },\n        {\n            \"name\": \"tagsPostsPerPage\",\n            \"label\": \"Tags posts per page\",\n            \"value\": 5,\n            \"type\": \"number\"\n        },\n        {\n            \"name\": \"authorsPostsPerPage\",\n            \"label\": \"Authors posts per page\",\n            \"value\": 5,\n            \"type\": \"number\"\n        },\n        {\n            \"name\": \"excerptLength\",\n            \"label\": \"Excerpt length\",\n            \"value\": 30,\n            \"type\": \"number\"\n        }\n    ],\n    \"customConfig\": [],\n    \"postConfig\": [],\n    \"pageConfig\": [],\n    \"files\": {\n        \"ignoreAssets\": [\n            \"scss\",\n            \".DS_Store\"\n        ],\n        \"assetsPath\": \"assets\",\n        \"partialsPath\": \"partials\",\n        \"useDynamicAssets\": false\n    },\n    \"customElements\": []\n}</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a>Copiar</a></div>\n</div>\n</div>\n<p>Los campos <code>name</code>, <code>version</code>, <code>author</code>son OBLIGATORIOS. Los demás campos se fusionarán con el archivo <strong>config.json</strong> predeterminado si algunos campos no existen en el archivo <strong>config.json</strong> del tema .</p>\n<h2 id=\"therenderersection\">La sección <strong>del renderizador</strong></h2>\n<p>La sección <strong>de renderizador</strong> contiene valores que no se deben cambiar en las opciones del tema, pero que pueden ser modificados por el desarrollador del tema o por usuarios más avanzados. Para obtener información más detallada sobre la configuración de las opciones <strong>del renderizador</strong> , consulta el artículo de la documentación de Publii sobre <a href=\"https://getpublii.com/dev/how-to-configure-rendering-process-of-your-website/\">Cómo configurar el proceso de renderizado de tu sitio web</a> .</p>\n<h2 id=\"thesupportedfeaturessection\">La sección de características admitidas</h2>\n<p>La sección supportedFeatures del archivo config.json se utiliza para indicar qué funciones de Publii son compatibles con el tema. Esto permite a los usuarios identificar fácilmente si un tema ofrece la funcionalidad deseada y facilita la elección de un tema que satisfaga sus necesidades.</p>\n<p>Para obtener más información sobre la sección Características compatibles y las funciones admitidas, consulta el artículo <a href=\"https://getpublii.com/dev/theme-supported-features/\">Características compatibles del tema</a> .</p>\n<h2 id=\"theconfigsection\">La sección <strong>de configuración</strong></h2>\n<p>La sección <strong>de configuración</strong> contiene algunas opciones útiles para el usuario y el renderizador de temas:</p>\n<ul>\n<li><strong>postsPerPage</strong> - número de publicaciones mostradas en la página de inicio y en la página de etiquetas (si no se ha configurado <strong>tags_posts_per_page ),</strong></li>\n<li><strong>tagsPostsPerPage</strong> - número de publicaciones mostradas en las páginas de etiquetas,</li>\n<li><strong>excerptLength</strong> - longitud de los extractos en palabras.</li>\n</ul>\n<p>Para las publicaciones por página, un valor de opción de 0 se define como una cantidad ilimitada (aunque técnicamente no es ilimitada; el máximo es 999 publicaciones por página) de publicaciones mostradas.</p>\n<p>La sección de archivos le permite modificar el comportamiento del renderizador:</p>\n<ul>\n<li><strong>ignoreAssets</strong> : una matriz que define los recursos (archivos y directorios) que se deben ignorar al copiar activos al directorio de salida.</li>\n<li><strong>assetsPath</strong> : especifica qué directorio contiene los activos del tema</li>\n<li><strong>partialsPath</strong> : especifica qué directorio contiene los archivos parciales del tema</li>\n<li><strong>useDynamicAssets</strong> : especifica si el tema usa <a href=\"https://getpublii.com/dev/dynamic-assets/\">activos dinámicos</a> o no.</li>\n<li><strong>responsiveImages</strong> : especifica el atributo de tamaño y las dimensiones (y el modo de recorte) de las miniaturas creadas. Si no se define la configuración de featuredImages, todas las imágenes utilizarán la configuración de contentImages. Puede utilizar \"auto\" en lugar de un número si desea cambiar el tamaño de las imágenes según una dimensión.</li>\n</ul>\n<p class=\"msg msg--warning\"><strong>¡ADVERTENCIA!</strong>  Los nombres de las dimensiones de las imágenes no pueden contener caracteres no latinos, espacios, comas, etc. y siempre deben estar en minúsculas.</p>\n<p>La sección <strong>de menús</strong> opcionales es un objeto con las áreas de menú disponibles.</p>\n<p class=\"msg msg--warning\"><strong>¡ADVERTENCIA!</strong> Las claves de este objeto solo deben utilizar letras, ya que se utilizarán en el menú parcial como parámetro del objeto de menús.</p>\n<p>En las secciones opcionales <strong>postTemplates/tagTemplates/authorTemplates</strong> , puede crear una colección de pares clave-valor que se usarán para generar la lista de plantillas de publicación/etiqueta/autor.</p>\n<p>La sección opcional <strong>customElements</strong> agrega estilos personalizados para elementos específicos que se pueden previsualizar en nuestro editor de publicaciones. Al agregar un <code>customElements</code>campo, puede usar todos los elementos personalizados que ofrece el <a href=\"https://www.tinymce.com/docs/demo/format-custom/\" target=\"_blank\" rel=\"noopener noreferrer\">editor TinyMCE</a> .</p>\n<h2 id=\"moreexamples\">Más ejemplos</h2>\n<p>Un ejemplo para la sección de menús:</p>\n<div class=\"code-toolbar\">\n<pre class=\"language-json\" tabindex=\"0\"><code>\"menus\": {\n    \"mainMenu\": \"Main menu\", \n    \"footerMenu\": \"Footer menu\"\n},</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a>Copiar</a></div>\n</div>\n</div>\n<p>Un ejemplo para la sección customElements:</p>\n<div class=\"code-toolbar\">\n<pre class=\"language-json\" tabindex=\"0\"><code>\"customElements\": [\n        {\n            \"label\": \"Custom style\",\n            \"cssClasses\": \"custom-style\",\n            \"tag\": \"span\"\n        },\n        {\n            \"label\": \"Custom style 2\",\n            \"cssClasses\": \"custom-style-2\",\n            \"selector\": \"p\"\n        }\n]</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a>Copiar</a></div>\n</div>\n</div>\n<p><strong>La etiqueta</strong> hace que el elemento quede envuelto por el elemento especificado en la etiqueta, con las clases CSS definidas en  <strong>cssClasses </strong> agregadas. Si se configura  el <strong>selector , las </strong><strong>cssClasses</strong> especificadas  se agregarán a los elementos que coincidan con el selector proporcionado (debe usarse especialmente al aplicar estilo a párrafos).</p>\n<p>Un ejemplo para la sección de plantillas:</p>\n<div class=\"code-toolbar\">\n<pre class=\"language-json\" tabindex=\"0\"><code>\"postTemplates\": {\n       \"alternative\": \"Post alternative template (from post-alternative.hbs file)\"\n},\n\"pageTemplates\": {\n       \"alternative\": \"Page alternative template (from page-alternative.hbs file)\"\n},\n\"tagTemplates\": {\n       \"alternative\": \"Tag alternative template (from tag-alternative.hbs file)\"\n},\n\"authorTemplates\": {\n       \"alternative\": \"Author alternative template (from author-alternative.hbs file)\"\n},</code></pre>\n</div>\n</div>",
            "image": "https://gabrielgenri.github.io/ProyectoWebs/media/posts/16/publii-cms.webp",
            "author": {
                "name": "Gabriel Genri"
            },
            "tags": [
                   "Publii"
            ],
            "date_published": "2024-10-11T01:17:55-03:00",
            "date_modified": "2024-10-11T02:13:08-03:00"
        },
        {
            "id": "https://gabrielgenri.github.io/ProyectoWebs/como-se-representa-el-tema.html",
            "url": "https://gabrielgenri.github.io/ProyectoWebs/como-se-representa-el-tema.html",
            "title": "¿Cómo se representa el tema?",
            "summary": "El proceso de renderizado de un tema tiene varios pasos; conocerlos es&hellip;",
            "content_html": "<header>\n<p class=\"post__title\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">El proceso de renderizado de un tema tiene varios pasos; conocerlos es muy útil si quieres comprender a fondo todas las posibilidades que puede ofrecer el renderizador.</span></p>\n</header>\n<div class=\"post__entry\">\n<p><span>El renderizador Publii puede funcionar en varios modos:</span></p>\n<ul>\n<li><span>Modo de vista previa de publicación</span></li>\n<li><span>Modo de vista previa de la página de etiquetas</span></li>\n<li><span>Modo de vista previa de la página del autor</span></li>\n<li><span>Modo de vista previa de la página de inicio</span></li>\n<li><span>Modo de página completa</span></li>\n</ul>\n<p><span>La vista previa de la publicación está disponible en el editor de publicaciones y se utiliza para obtener una vista previa de los cambios antes de implementarlos en el servidor.</span></p>\n<p><span>El modo de vista previa de etiqueta, autor y página de inicio se utiliza para verificar rápidamente los cambios durante la edición de parámetros en la configuración de Publii para subpáginas determinadas.</span></p>\n<p><span>El modo de página completa se utiliza para crear una vista previa y durante la sincronización del sitio web.</span></p>\n<p><span>Nos centraremos aquí en el modo de página completa; otros modos funcionan de forma muy similar pero sólo representan una página específica.</span></p>\n<h2 id=\"renderingprocess\"><span>Proceso de renderizado</span></h2>\n<ol>\n<li><span>El tema está validado,</span></li>\n<li><span>La configuración del sitio está cargada,</span></li>\n<li><span>Las traducciones están cargadas,</span></li>\n<li><span>El renderizador carga datos del sitio web desde la base de datos,</span></li>\n<li><span>La configuración del tema está cargada,</span></li>\n<li><span>Se cargan los archivos de tema,</span></li>\n<li><span>Los ayudantes de Publii Handlebars están registrados,</span></li>\n<li><span>Los ayudantes de tema de helpers.js (si existen) están registrados,</span></li>\n<li><span>La estructura del contenido se carga y almacena en caché.</span></li>\n<li><span>Se cargan datos comunes para todas las vistas,</span></li>\n<li><span>Se registran parciales (estándar y personalizados),</span></li>\n<li><span>Se muestra la página de inicio y su paginación,</span></li>\n<li><span>Se representan las páginas de publicación ( </span><a href=\"https://getpublii.com/dev/how-the-post-content-is-modified-before-the-output/\"><span>se aplican algunas operaciones</span></a><span> al contenido de la publicación antes de la salida),</span></li>\n<li><span>Se representan las páginas de etiquetas y su paginación.</span></li>\n<li><span>Se representan las páginas del autor y su paginación,</span></li>\n<li><span>Se muestra la página de error (si se utiliza),</span></li>\n<li><span>Se muestra la página de búsqueda (si se utiliza),</span></li>\n<li><span>Se crea CSS,</span></li>\n<li><span>Los archivos de configuración, los activos y los archivos multimedia se copian al directorio de salida.</span></li>\n<li><span>Se procesan las fuentes RSS y JSON.</span></li>\n<li><span>Se crea el mapa del sitio,</span></li>\n</ol>\n<p><span>Puedes utilizar </span><a href=\"https://getpublii.com/dev/how-to-create-custom-handlebars-helpers/\"><span>ayudantes</span></a><span> y </span><a href=\"https://getpublii.com/dev/creating-custom-partials/\"><span>parciales</span></a><span> personalizados en tu tema.</span></p>\n<p><span>El tema CSS es una suma de cinco fuentes CSS:</span></p>\n<div class=\"code-toolbar\">\n<pre class=\"language-html\" tabindex=\"0\"><code>theme-variables.js output + main.css + GDPR popup CSS + visual-overrides.js output + custom CSS</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a><span>Copiar</span></a></div>\n</div>\n</div>\n<p><span>Veamos estas fuentes CSS:</span></p>\n<ul>\n<li><strong><a href=\"https://getpublii.com/dev/theme-variables/\"><span>theme-variables.js</span></a></strong><span> : es un archivo opcional que se puede utilizar para generar un código CSS que anteponga el código CSS de su tema. El caso principal de uso es la compatibilidad con variables CSS. Como puede obtener opciones de tema en este archivo, puede crear variables CSS basadas en ellas y luego usarlas en su código main.css.</span></li>\n<li><strong><span>main.css</span></strong><span> : es un archivo obligatorio que contiene el CSS principal de su tema</span></li>\n<li><strong><a href=\"https://getpublii.com/dev/prepare-theme-gdpr-compliant/\"><span>CSS de ventana emergente GDPR</span></a></strong><span> : este es un código CSS generado por Publii. Actualmente, no puedes modificar este código CSS directamente; debes usar CSS personalizado o modificaciones visuales para realizar cambios.</span></li>\n<li><strong><a href=\"https://getpublii.com/dev/visual-overrides/\"><span>visual-overrides.js</span></a></strong><span> : es un archivo opcional que funciona como</span><strong><span> theme-variables.js</span></strong><span> , pero agrega el código CSS a la salida del archivo main.css.</span></li>\n<li><strong><span>CSS personalizado</span></strong><span> : es un código que agrega el usuario en </span><strong><span>Herramientas -&gt; Vista CSS personalizada</span></strong><span> en Publii. Este código CSS es el último código CSS que se agrega a la salida CSS y puede anular todo lo generado anteriormente.</span></li>\n</ul>\n<p><strong><span>En breve:</span></strong></p>\n<p><span>La salida del archivo </span><strong><span>visual-overrides.js</span></strong><span> reemplaza el código </span><strong><span>main.css</span></strong><span> , pero cualquier código CSS generado por Publii se puede reemplazar con código CSS personalizado que se agrega en la sección Herramientas de Publii. La salida de theme-variables.js también puede anteponer todo el código.</span></p>\n</div>",
            "author": {
                "name": "Gabriel Genri"
            },
            "tags": [
                   "Publii"
            ],
            "date_published": "2024-10-11T01:17:08-03:00",
            "date_modified": "2024-10-11T01:17:08-03:00"
        },
        {
            "id": "https://gabrielgenri.github.io/ProyectoWebs/estructura-del-tema.html",
            "url": "https://gabrielgenri.github.io/ProyectoWebs/estructura-del-tema.html",
            "title": "Estructura del tema",
            "summary": "Cada tema de Publii debe contener algunos archivos obligatorios, pero también se&hellip;",
            "content_html": "<header>\n<p class=\"post__title\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Cada tema de Publii debe contener algunos archivos obligatorios, pero también se pueden incluir algunos archivos de forma opcional en el tema.</span></p>\n</header>\n<div class=\"post__entry\">\n<p>Se requieren los siguientes archivos:</p>\n<ul>\n<li><strong>config.json</strong> - archivo de configuración del tema principal,</li>\n<li><strong>index.hbs</strong> - plantilla de página de inicio,</li>\n<li><strong>post.hbs</strong> - plantilla de publicación única,</li>\n<li><strong>miniatura.png</strong> - que se mostrará en la configuración de la aplicación (dimensiones requeridas: 400x300px),</li>\n<li><strong>assets/css/main.css</strong> : archivo CSS principal que se utiliza para generar el archivo <strong>styles.css (que se fusiona con el archivo </strong><strong>override.css</strong> generado opcionalmente ).</li>\n</ul>\n<p>Se recomiendan estos archivos:</p>\n<ul>\n<li><strong>tag.hbs</strong> - plantilla de página de etiqueta única,</li>\n<li><strong>tags.hbs</strong> - plantilla de página de etiquetas individuales,</li>\n<li><strong>author.hbs</strong> - plantilla de página de autor único,</li>\n<li><strong>partials/</strong> - ubicación de los archivos que se cargarán con el uso del <code>{{&gt; fileName}}</code>código,</li>\n<li><strong>partials/footer.hbs</strong> - pie de página utilizado en todas las páginas,</li>\n<li><strong>partials/header.hbs</strong> - encabezado utilizado en todas las páginas</li>\n</ul>\n<p>Y estos archivos son opcionales:</p>\n<ul>\n<li><strong>visual-override.js</strong> : archivo que contiene una función utilizada para <strong>generar el</strong> archivo override.css,</li>\n<li><strong>feed-xml.hbs</strong> : la estructura del archivo XML del feed, generado como <strong>feed.xml</strong> (el archivo <strong>feed-xml.hbs</strong> se reemplazará con el predeterminado de la aplicación si no existe uno en el tema),</li>\n<li><strong>feed-json.hbs</strong> : la estructura del archivo JSON del feed, generado como <strong>feed.json</strong> (el archivo <strong>feed-json.hbs</strong> se reemplazará con el predeterminado de la aplicación si no existe uno en el tema),</li>\n<li><strong>search.hbs</strong> : plantilla de página de resultados de búsqueda dedicada. Esta plantilla es necesaria para los temas que pretenden ofrecer capacidades de búsqueda mejoradas o integrarse con complementos de búsqueda específicos, como un complemento de búsqueda de Google. </li>\n<li><strong>partials/pagination.hbs</strong> - paginación para todas las páginas (la paginación parcial será reemplazada con la predeterminada de la aplicación si no existe en el tema),</li>\n<li><strong>partials/menu.hbs</strong> - estructura del menú para todas las páginas (el menú parcial será reemplazado por el predeterminado de la aplicación si no existe uno en el tema).</li>\n<li><strong>post-template.hbs</strong> : un archivo de plantilla de publicación alternativa que se puede seleccionar para publicaciones individuales y que ofrece un diseño personalizado distinto de la <code>post.hbs</code>plantilla predeterminada.</li>\n<li><strong>tag-template.hbs</strong> : un archivo de plantilla personalizado para páginas de etiquetas individuales. Esta plantilla permite un diseño o disposición únicos para páginas que incluyen publicaciones asociadas con una etiqueta en particular. </li>\n<li><strong>author-template.hbs</strong> : un archivo de plantilla alternativo dedicado a la página de cada autor. Esta plantilla le permite aplicar un diseño o disposición únicos para las páginas que muestran publicaciones escritas por un autor específico. </li>\n<li><strong>helpers.js</strong> : un archivo JavaScript que contiene definiciones de ayudantes Handlebars personalizados adaptados a las necesidades específicas del tema. </li>\n<li><strong>dynamic-assets-mapping.js</strong> : un archivo JavaScript que genera una lista de rutas de recursos que se deben cargar de forma dinámica según la configuración del tema. El uso principal de este archivo es administrar recursos como fuentes, imágenes u otros medios que pueden variar según las opciones de personalización del usuario o las opciones del tema.</li>\n<li><strong>theme-variables.js</strong> : un archivo JavaScript que genera dinámicamente propiedades CSS personalizadas (variables) en función de la configuración del tema. El resultado <code>theme-variables.js</code>es crucial para definir parámetros de estilo fundamentales, como colores, familias de fuentes, tamaños y más. El aspecto clave de este archivo es que su resultado se inyecta normalmente al principio del <code>style.css</code>  archivo. Esta posición garantiza que las variables CSS definidas estén disponibles y se puedan utilizar en el resto del archivo CSS, lo que proporciona una base de estilo coherente y fácilmente personalizable para el tema.</li>\n<li><strong>visual-override.js</strong> : el propósito de este archivo JavaScript es generar estilos CSS personalizados que permitan modificaciones específicas de los estilos predeterminados del tema en función de los parámetros configurados por el usuario. A diferencia de <code>theme-variables.js</code>, la salida de <code>visual-override.js</code>se agrega al final del <code>style.css</code>archivo. Esta ubicación es estratégica, ya que garantiza que las modificaciones personalizadas precedan a los estilos definidos previamente, lo que permite una personalización y ajustes efectivos de la apariencia del tema. </li>\n</ul>\n</div>",
            "author": {
                "name": "Gabriel Genri"
            },
            "tags": [
                   "Publii"
            ],
            "date_published": "2024-10-11T01:15:50-03:00",
            "date_modified": "2024-10-11T02:13:51-03:00"
        },
        {
            "id": "https://gabrielgenri.github.io/ProyectoWebs/el-complemento-de-busqueda-estatica.html",
            "url": "https://gabrielgenri.github.io/ProyectoWebs/el-complemento-de-busqueda-estatica.html",
            "title": "El complemento de búsqueda estática",
            "summary": "El complemento Static Search ofrece la búsqueda más fluida, rápida y sencilla&hellip;",
            "content_html": "<header>\n<p class=\"post__title\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">El complemento Static Search ofrece la búsqueda más fluida, rápida y sencilla posible en su sitio Publii. Basado en la biblioteca de búsqueda FlexSearch, Static Search ofrece resultados dinámicos instantáneos para cualquier término de búsqueda y viene equipado con una gran cantidad de opciones y configuraciones para ajustar la funcionalidad a la perfección para satisfacer las necesidades de los visitantes de su sitio.</span></p>\n</header>\n<div class=\"post__entry\">\n<h2 id=\"enablingthesearchsection\"><span>Habilitar la sección de Búsqueda</span></h2>\n<p><span>Todos los temas oficiales de Publii tienen un área de búsqueda integrada en el tema, que deberá habilitarse para que el complemento pueda funcionar. Para habilitar la sección de búsqueda:</span></p>\n<ol>\n<li><span>En el menú principal de Publii, en la barra lateral izquierda, haga clic en la opción </span><strong><span>Tema</span></strong><span>  para abrir la pantalla de configuración.</span></li>\n<li><span>En la segunda sección de esta pantalla, </span><strong><span>Configuración personalizada</span></strong><span> , haga clic en la pestaña </span><strong><span>Buscar</span></strong><span> en la lista de opciones debajo del título de configuración personalizada para abrir las opciones de búsqueda.</span></li>\n<li><span>Haga clic en el botón de cambio junto a la opción </span><strong><span>Buscar</span></strong><span> para habilitar la barra de búsqueda.</span></li>\n<li><span>El área ahora está habilitada en tu tema y puedes continuar habilitando y configurando el complemento de Búsqueda estática.</span></li>\n</ol>\n<h2 id=\"addingstaticsearchpluginsupporttoyourthemeforolderorcustomthemes\"><span>Cómo agregar compatibilidad con el complemento de búsqueda estática a su tema (para temas antiguos o personalizados)</span></h2>\n<p><span>Para mostrar un cuadro de búsqueda en su sitio, simplemente agregue el siguiente fragmento de código donde desee que aparezca. Esto generará un campo de búsqueda y un botón que los visitantes pueden usar para buscar en su sitio lo que estén buscando.</span></p>\n<div class=\"code-toolbar\">\n<pre class=\"language-handlebars\" tabindex=\"0\"><code>{{{@customSearchInput}}}</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a><span>Copiar</span></a></div>\n</div>\n</div>\n<p><span>También necesitamos modificar el archivo config.json (solo si su tema no admite los complementos de búsqueda) actualizando las secciones ' </span><strong><span>renderer</span></strong><span> ' y ' </span><strong><span>supportedFeatures</span></strong><span> ' con los siguientes indicadores:</span></p>\n<div class=\"code-toolbar\">\n<pre class=\"language-json\" tabindex=\"0\"><code>\"renderer\": {    \n     \"createSearchPage\": true,\n     \"createContentStructure\": true\n },\n \"supportedFeatures\": {\n     \"searchPage\": true,\n     \"customSearch\": true\n },</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a><span>Copiar</span></a></div>\n</div>\n</div>\n<h2 id=\"enablingtheplugin\"><span>Habilitar el complemento</span></h2>\n<p><span>Para activar el complemento, abra la sección </span><strong><span>Herramientas y complementos</span></strong><span> de la aplicación Publii a través del menú de la izquierda para ver una lista de los complementos instalados. Haga clic en el botón de cambio en la parte inferior izquierda del mosaico </span><strong><span>de Búsqueda estática</span> </strong><span>en esta lista para habilitar el complemento.</span></p>\n<p><span>Una vez que se hayan habilitado el complemento y el área de búsqueda en el tema, la función de búsqueda estará lista para usarse en su sitio, pero como la búsqueda estática incluye una serie de configuraciones para ajustar la funcionalidad de búsqueda, es una buena idea abrir la configuración del complemento y asegurarse de que todo esté configurado para satisfacer sus necesidades.</span></p>\n<p><span>Para abrir la configuración del complemento, haga clic en el mosaico </span><strong><span>de búsqueda estática</span></strong><span> una vez más, en cualquier lugar excepto en el botón del selector, y se abrirá la pantalla de configuración. Tenga en cuenta que esta pantalla no estará disponible si el complemento no se habilita primero.</span></p>\n<h2 id=\"staticsearchoptions\"><span>Opciones de búsqueda estática</span></h2>\n<p><span>El complemento de búsqueda estática ofrece varias opciones que permiten a los usuarios especificar exactamente cómo debe funcionar la función de búsqueda en su sitio. Si lo prefiere, las opciones predeterminadas proporcionarán una experiencia de búsqueda fluida, por lo que modificar estas configuraciones es completamente opcional. Las configuraciones disponibles son las siguientes:</span></p>\n<h3 id=\"searchconfiguration\"><span>Configuración de búsqueda</span></h3>\n<ul>\n<li><strong><span>Abrir una ventana emergente de búsqueda al hacer clic en la entrada de búsqueda</span></strong><span> : cuando esta opción está habilitada, cuando el visitante hace clic en la entrada de búsqueda, se abrirá inmediatamente una ventana emergente de búsqueda, que generalmente solo se mostrará una vez que se ejecute una búsqueda.</span></li>\n<li><strong><span>Abrir una ventana emergente de búsqueda mediante el selector CSS</span></strong><span> : cuando esta opción está habilitada, cuando el visitante hace clic en cualquier elemento, por ejemplo, un icono de vidrio o un enlace, se abrirá inmediatamente la ventana emergente de búsqueda. Esta opción requiere un selector CSS en el campo </span><strong><span>Selector CSS .</span></strong></li>\n<li><strong><span>Selector CSS</span></strong><span> : agregue aquí cualquier selector CSS válido para seleccionar un elemento HTML, de modo que la ventana emergente de búsqueda se muestre cuando haga clic en ese elemento. Por ejemplo, si desea que se muestre una ventana emergente cuando haga clic en un botón, agregue una clase CSS llamada, por ejemplo, \" </span><em><span>search-popup\"</span></em><span> a ese botón, por ejemplo </span><code>&lt;button class=\"search-popup\"&gt; Open search popup &lt;/button&gt;</code><span>.</span></li>\n<li><strong><span>Botón Enviar</span></strong><span> : si esta opción está habilitada, se mostrará un botón Enviar en el cuadro de búsqueda; los visitantes pueden hacer clic en este botón para iniciar la búsqueda o presionar \"Entrar\" normalmente.</span></li>\n<li><strong><span>Recuento mínimo de caracteres para activar la búsqueda</span></strong><span> : esta opción establece la cantidad mínima de caracteres que se deben ingresar en la entrada de búsqueda antes de que se muestren los resultados.</span></li>\n<li><strong><span>Número máximo de resultados de búsqueda</span></strong><span> : establece el número máximo de resultados de búsqueda que se pueden mostrar a la vez cuando se ejecuta una búsqueda, y los más relevantes aparecen primero.</span></li>\n<li><strong><span>Mostrar descripción en los resultados como</span></strong><span> : elija si desea mostrar información adicional con cada elemento listado en los resultados de búsqueda; las opciones disponibles son:</span>\n<ul>\n<li><strong><span>Ninguno</span></strong><span> : los resultados mostrarán solo el título de la publicación/página, sin ninguna información adicional.</span></li>\n<li><strong><span>Extracto</span></strong><span> : los resultados mostrarán un extracto del contenido del artículo; la longitud del extracto depende de la configuración </span><strong><span>de Longitud del extracto</span></strong><span> en la sección </span><strong><span>Configuración del tema &gt; Configuración básica</span></strong><span> de la aplicación Publii, o donde sea que se encuentre el texto \"leer más\" en un artículo si se usa un extracto personalizado.</span></li>\n<li><strong><span>Meta descripción</span></strong><span> : los resultados mostrarán una descripción tomada de las meta descripciones de las publicaciones.</span></li>\n</ul>\n</li>\n<li><strong><span>Marcador de posición de entrada de búsqueda</span></strong><span> : el texto ingresado en este campo se mostrará como un marcador de posición en la entrada de búsqueda.</span></li>\n<li><strong><span>Etiqueta del botón de búsqueda</span></strong><span> : el texto ingresado en este campo se mostrará como el nombre del botón de búsqueda.</span></li>\n<li><strong><span>Marcador de posición de entrada de búsqueda emergente</span></strong><span> : el texto ingresado en este campo se mostrará de manera predeterminada en la entrada de búsqueda emergente cuando se abra.</span></li>\n<li><strong><span>Estado de búsqueda vacío</span></strong><span> : el texto ingresado en este campo se mostrará en el área de resultados de la pantalla cuando el visitante no haya ingresado caracteres en la entrada de búsqueda.</span></li>\n<li><strong><span>Texto que se muestra cuando la frase es demasiado corta</span></strong><span> : el texto en este campo se mostrará cuando el visitante no haya ingresado la cantidad requerida de caracteres para la búsqueda, como se define en la opción </span><strong><span>Recuento mínimo de caracteres .</span></strong></li>\n<li><strong><span>Estado sin resultados</span></strong><span> : el texto de este campo se mostrará en el área de resultados cuando se haya ejecutado una búsqueda, pero no haya resultados coincidentes para el término de búsqueda ingresado.</span></li>\n<li><strong><span>Botón Cerrar</span></strong><span> : establece el texto del botón que cierra la ventana emergente de búsqueda (visible solo en la vista móvil)</span></li>\n</ul>\n<h3 id=\"indexconfiguration\"><span>Configuración del índice</span></h3>\n<p><span>La sección de configuración de índice contiene las opciones más importantes para el complemento de búsqueda estática. Las distintas configuraciones de esta sección indican al complemento qué contenido de su sitio debe indexarse; es decir, qué partes del contenido de su sitio, como títulos, extractos, encabezados, etc., debe recopilar y almacenar el complemento para que los visitantes de su sitio puedan buscarlas.</span></p>\n<p class=\"msg msg--highlight msg--info\"><strong><span>Nota:</span></strong><span> La mayoría de los usuarios pueden dejar habilitadas todas las opciones de esta sección para permitir una búsqueda más amplia y precisa para los visitantes de su sitio. Sin embargo, si el sitio indexado tiene una gran cantidad de publicaciones, el archivo de índice que se crea puede ser relativamente grande; en tales casos, puede ser útil limitar la indexación a elementos específicos para reducir el peso total del archivo. Además, asegúrese de que </span><strong><span>GZIP/Brotli</span></strong><span> esté activado en su servidor; esto reducirá el tamaño del índice de búsqueda.</span></p>\n<p><span>Las opciones en esta sección son:</span></p>\n<ul>\n<li><strong><span>Habilitar la indexación de publicaciones</span></strong><span> : si esta opción está habilitada, los elementos de publicación seleccionados, como el título de la publicación, el extracto y los encabezados, se indexarán para la búsqueda.</span></li>\n<li><strong><span>Excluir publicaciones ocultas</span></strong><span> : si esta opción está habilitada, las publicaciones marcadas como </span><strong><span>ocultas</span></strong><span> no serán indexadas por el complemento de búsqueda ni se mostrarán en los resultados de búsqueda.</span></li>\n<li><strong><span>Título de la publicación</span></strong><span> : si está habilitado, los títulos de las publicaciones se indexarán y se utilizarán en las búsquedas.</span></li>\n<li><strong><span>Extracto</span></strong><span> : si se habilita esta opción, se indexarán extractos de las publicaciones y se usarán en las búsquedas. La cantidad de contenido que se indexa depende de la configuración </span><strong><span>de Longitud del extracto</span></strong><span> en la sección </span><strong><span>Configuración del sitio &gt; Configuración básica</span></strong><span> de la aplicación Publii, o de dónde se haya agregado la opción Leer más si se usa un extracto personalizado.</span></li>\n<li><strong><span>Encabezados (H1-H6)</span></strong><span> : si esta opción está habilitada, los encabezados dentro del contenido de su publicación se indexarán y se usarán en las búsquedas.</span></li>\n<li><strong><span>Nombre del autor</span></strong><span> : si está habilitado, el nombre del autor en las publicaciones se indexará y se usará en las búsquedas; es útil si desea permitir que los visitantes busquen por nombre de autor sin ir a la página específica del autor.</span></li>\n<li><strong><span>Meta descripción</span></strong><span> : si está habilitada, el contenido de la meta descripción de cada publicación se indexará y se utilizará en las búsquedas.</span><br><br></li>\n<li><strong><span>Habilitar indexación de etiquetas</span></strong><span> : si está habilitado, los elementos de etiqueta seleccionados, como el nombre de la etiqueta y la descripción, se indexarán para la búsqueda.</span></li>\n<li><strong><span>Excluir etiquetas ocultas</span></strong><span> : si esta opción está habilitada, las etiquetas que estén </span><strong><span>ocultas</span></strong><span> no se indexarán ni se mostrarán en los resultados de búsqueda.</span></li>\n<li><strong><span>Nombre de la etiqueta</span></strong><span> : si está habilitado, el título de la etiqueta se indexará y se utilizará en las búsquedas.</span></li>\n<li><strong><span>Descripción de la etiqueta</span></strong><span> : si está habilitada, el texto de descripción de cada etiqueta se indexará y se utilizará en las búsquedas.</span></li>\n<li><strong><span>Meta descripción</span></strong><span> : si está habilitada, la meta descripción de cada página de etiqueta se indexará y se utilizará para búsquedas.</span><br><br></li>\n<li><strong><span>Habilitar la indexación de configuración posterior</span></strong><span> : si está habilitado, puede indexar las opciones de configuración posterior seleccionadas. </span></li>\n<li><strong><span>Campos a indexar</span></strong><span> : especifique los nombres de los campos de configuración posterior a indexar, separados por comas.</span></li>\n</ul>\n<h3 id=\"advancedoptions\"><span>Opciones avanzadas</span></h3>\n<ul>\n<li><strong><span>Valor de la opción Tokenizar</span></strong><span> : esta opción establece el comportamiento del proceso de búsqueda; es decir, cómo busca las palabras que se buscan y qué tan efectiva es la búsqueda. En términos generales, la configuración </span><strong><span>Completa</span></strong><span> proporcionará la experiencia de búsqueda más efectiva, pero se pueden usar opciones alternativas más simples en sitios web grandes para limitar la cantidad de memoria necesaria para la búsqueda. Las configuraciones disponibles para esta opción son:</span>\n<ul>\n<li><strong><span>Estricto</span></strong><span> : solo se mostrarán en los resultados las coincidencias exactas para el término de búsqueda.</span></li>\n<li><strong><span>Adelante</span></strong><span> : las palabras se buscan comenzando desde la primera letra en un orden hacia adelante, lo que permite mostrar coincidencias parciales; las palabras sin terminar o las palabras con errores ortográficos al final seguirán mostrando resultados, por ejemplo, si busca \"Prueba\", ingresar solo \"Tes\" proporcionará algunos resultados.</span></li>\n<li><strong><span>Invertir</span></strong><span> : se mostrará un resultado cuando las letras del término de búsqueda aparezcan tanto en orden directo como inverso, lo que proporciona aún más soporte para errores ortográficos o búsquedas incompletas, por ejemplo, si busca \"Prueba\", ingresar \"Tes\" o \"ing\" proporcionará algunos resultados.</span></li>\n<li><strong><span>Completo</span></strong><span> : combina todo lo anterior, más coincidencias parciales para la sección central del término de búsqueda; por ejemplo, si busca \"Pruebas\", ingresar \"Tes\", \"ing\" o \"sti\", u otras combinaciones de estos, proporcionará algunos resultados.</span></li>\n</ul>\n</li>\n<li><strong><span>Juego de caracteres</span></strong><span> : establece el conjunto de caracteres que el complemento de búsqueda estática debe utilizar en las búsquedas. De forma predeterminada, esta opción cubrirá de forma segura todos los idiomas europeos que utilizan el alfabeto latino, incluidos los caracteres adicionales para los idiomas con letras acentuadas.</span></li>\n<li><strong><span>Idioma</span></strong><span> : establece el idioma que se utilizará en las búsquedas al reconocer palabras similares que provienen de la misma palabra base, por ejemplo, conjugaciones de un verbo. Utiliza la </span><a href=\"https://www.andiamo.co.uk/resources/iso-language-codes/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\"><span>convención de nomenclatura ISO-3166</span></a><span> para idiomas. Tenga en cuenta que no todos los idiomas son compatibles.</span></li>\n<li><strong><span>Habilitar caché</span></strong><span> : si está habilitado, el complemento de búsqueda estática utilizará el caché disponible para almacenar búsquedas populares a fin de proporcionar funciones de autocompletado y búsqueda instantánea al escribir en la barra de búsqueda. Las opciones disponibles en esta sección son:</span>\n<ul>\n<li><strong><span>Deshabilitado</span></strong><span> : no se almacenarán búsquedas; las búsquedas pueden ejecutarse más lentamente que cuando el caché está habilitado.</span></li>\n<li><strong><span>Habilitado - sin límite de tamaño</span></strong><span> - Las búsquedas se guardarán para proporcionar búsquedas dinámicas al escribir y sugerencias de autocompletar si está habilitado.</span></li>\n<li><strong><span>Habilitado - con límite de tamaño</span></strong><span> - Las búsquedas se guardarán hasta un límite específico; después del cual, solo se almacenarán las búsquedas más populares para proporcionar búsquedas y sugerencias dinámicas.</span></li>\n</ul>\n</li>\n<li><strong><span>Tamaño de caché</span></strong><span> : esta opción solo está disponible cuando la opción </span><strong><span>Habilitar caché</span></strong><span> está configurada en </span><strong><span>Habilitada - con límite de tamaño</span></strong><span> . El número ingresado en este campo define la cantidad máxima de búsquedas que el complemento debe guardar para búsquedas y sugerencias dinámicas. De manera predeterminada, está configurado en 100.</span></li>\n<li><strong><span>Habilitar sugerencias</span></strong><span> : si está habilitado, la búsqueda ofrecerá sugerencias de autocompletar a los visitantes mientras escriben en la barra de búsqueda, según búsquedas populares que se hayan realizado anteriormente.</span></li>\n<li><strong><span>URL relativas - dominio</span></strong><span> : establece el dominio que utilizará la búsqueda para crear enlaces adecuados en el índice de búsqueda.</span>\n<p class=\"msg msg--info\"><strong><span>Nota:</span></strong><span> utilice esta opción solo cuando utilice URL relativas en la configuración del servidor.</span></p>\n</li>\n</ul>\n<h2 id=\"customizingthestaticsearchpluginsappearance\"><span>Personalizar la apariencia del complemento de búsqueda estática</span></h2>\n<p><span>Es posible que los usuarios avanzados o los desarrolladores de temas deseen modificar la apariencia del cuadro de búsqueda del complemento y la página de búsqueda emergente; la información de esta sección lo ayudará a comenzar a personalizar la búsqueda para que se ajuste a la estética de su tema.</span></p>\n<h3 id=\"whatcodegeneratesthestaticsearchbox\"><span>¿Qué código genera el cuadro de búsqueda estática?</span></h3>\n<p><span>Cuando está habilitado, el complemento de búsqueda estática genera un \"cuadro de entrada\", que es un formulario con un área de entrada donde los visitantes pueden ingresar su término de búsqueda y un botón para enviar la búsqueda. Este formulario se agrega a la página principal del tema. El código que se genera para este cuadro de entrada es el siguiente:</span></p>\n<p><span>Generará la siguiente salida:</span></p>\n<div class=\"code-toolbar\">\n<pre class=\"language-handlebars\" tabindex=\"0\"><code>&lt;form action=\"#search\" class=\"search__form\"&gt;\n   &lt;input class=\"search__input\" type=\"search\" placeholder=\"Search\" aria-label=\"Search\"&gt; \n   &lt;button type=\"submit\" class=\"search__button\"&gt;\n      &lt;span&gt;Search&lt;/span&gt;\n   &lt;/button&gt;\n&lt;/form&gt;</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a><span>Copiar</span></a></div>\n</div>\n</div>\n<p><span>Este código puede ser útil si desea adaptar el cuadro de búsqueda a su tema.</span></p>\n<h3 id=\"modifyingthesearchresultsappearance\"><span>Modificar la apariencia de los resultados de búsqueda</span></h3>\n<p><span>Los resultados de una búsqueda determinada se muestran en una ventana emergente modal; al utilizar la herramienta </span><strong><span>CSS personalizada</span></strong><span> que se puede encontrar en la sección </span><strong><span>Herramientas y complementos</span></strong><span> del menú principal de Publii, los usuarios pueden modificar la apariencia de la ventana emergente de resultados según sus necesidades.</span></p>\n<h4 id=\"availablecssvariables\"><span>Variables CSS disponibles</span></h4>\n<p><span>A continuación encontrará una lista de las variables CSS disponibles que se utilizan para diseñar la ventana emergente de resultados; puede copiar todo el bloque de código a su herramienta </span><strong><span>CSS personalizada</span></strong><span> y realizar modificaciones, o realizar cambios solo en variables CSS específicas de la lista.</span></p>\n<div class=\"code-toolbar\">\n<pre class=\"language-css\" tabindex=\"0\"><code>:root {    \n    --pss-width: 672px; \n    --pss-popup-min-height: 210px; \n    --pss-popup-max-height: 576px; \n    --pss-popup-input-height: 70px; \n    --pss-border-radius: 4px; \n    --pss-spacing: 20px; \n    --pss-font-base-size: 15px; \n    --pss-font-family: inherit; \n    --pss-results-title-font-weight: 500; \n    --pss-results-excerpt-line-height: 1.2; \n    \n    --pss-bg: #fff; \n    --pss-overlay: rgba(184, 186, 193, 0.9); \n    --pss-border-color: #e7e8ea; \n    --pss-color: #0079f2; \n    --pss-msg-text-color: #6A7082; \n    --pss-input-bg: #fff; \n    --pss-input-text-color: #32353e; \n    --pss-input-placeholder-color: #7f8596; \n    --pss-button-close-bg: #6A7082; \n    --pss-button-close-color: #fff; \n    --pss-results-title-color: #32353e; \n    --pss-results-title-color-hover: #fff; \n    --pss-results-excerpt-color: #6A7082; \n    --pss-results-excerpt-color-hover: #fff; \n    --pss-results-icon-color: #969faf; \n    --pss-results-icon-color-hover: #fff; \n    --pss-results-highlight-bg: #0079f2; \n  } \n    \n  @media (prefers-color-scheme: dark) { \n    :root { \n      --pss-bg: #191a1f; \n      --pss-overlay: rgba(10, 10, 12, 0.8); \n      --pss-border-color: #2A2B34; \n      --pss-color: #1089ff; \n      --pss-msg-text-color: #7f8596; \n      --pss-input-bg: #191a1f; \n      --pss-input-text-color: #d9d9e0; \n      --pss-input-placeholder-color: #7f8596; \n      --pss-button-close-bg: #393A47; \n      --pss-button-close-color: #fff; \n      --pss-results-title-color: #d9d9e0; \n      --pss-results-title-color-hover: #fff; \n      --pss-results-excerpt-color: #8c8ea3; \n      --pss-results-excerpt-color-hover: #fff; \n      --pss-results-icon-color: #7f8596; \n      --pss-results-icon-color-hover: #fff; \n      --pss-results-highlight-bg: #1089ff; \n    } \n  }\n</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a><span>Copiar</span></a></div>\n</div>\n</div>\n</div>\n<footer>\n<div class=\"post__footer-top\">\n<div class=\"post__meta\"><time datetime=\"2022-06-22T05:35\"><span>22 de junio de 2022</span></time><span>Actualizado el:</span><time datetime=\"2023-11-15T11:04\"><span>15 de noviembre de 2023</span></time></div>\n</div>\n</footer>",
            "author": {
                "name": "Gabriel Genri"
            },
            "tags": [
                   "Publii"
            ],
            "date_published": "2024-10-11T01:09:34-03:00",
            "date_modified": "2024-10-11T01:09:34-03:00"
        },
        {
            "id": "https://gabrielgenri.github.io/ProyectoWebs/como-traducir-tu-tema-de-publii-a-otro-idioma.html",
            "url": "https://gabrielgenri.github.io/ProyectoWebs/como-traducir-tu-tema-de-publii-a-otro-idioma.html",
            "title": "Cómo traducir tu tema de Publii a otro idioma",
            "summary": "Es bastante fácil crear un sitio web en tu idioma nativo con&hellip;",
            "content_html": "<header>\n<p class=\"post__title\"><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\">Es bastante fácil crear un sitio web en tu idioma nativo con Publii; ¡solo crea el contenido! Pero si lo haces, te darás cuenta rápidamente de que hay un pequeño problema: los pequeños fragmentos de texto adicionales que vienen con el tema, como el texto </span><strong style=\"font-family: var(--editor-font-family); font-size: inherit;\">de Publicado</strong><span style=\"color: var(--text-primary-color); font-family: var(--editor-font-family); font-size: inherit; font-weight: var(--font-weight-normal);\"> el que ves en la parte superior de una publicación o las etiquetas de los botones de tus redes sociales, no aparecen en el editor de contenido ni en las opciones generales de Publii. Esto los convierte en un pequeño inconveniente en un sitio que no está en inglés, ya que siempre tendrás algunos fragmentos sueltos en inglés que arruinarán tu estética.</span></p>\n</header>\n<div class=\"post__entry\">\n<p><span>Entonces, ¿por qué no hay opciones para cambiar estos fragmentos de texto? Esto se debe a que estos elementos se crean y definen en el código del tema, en lugar de en la aplicación principal de Publii o en el contenido producido por el usuario. Como cada tema es único, no es posible producir una opción estandarizada para modificar este texto sin restringir gravemente la creatividad de los desarrolladores, ¡algo que no queremos fomentar!</span></p>\n<p><span>Afortunadamente, desde el lanzamiento de la versión Beta 3, Publii ha incluido una nueva característica: compatibilidad con archivos de idioma en los temas, lo que permite a los desarrolladores de temas definir el texto de su tema a través de un archivo .json, en lugar de codificar todo el texto directamente en el tema. Este archivo se puede reemplazar con un archivo de usuario, traduciendo el idioma sin tocar los archivos originales. Si no estás familiarizado con el archivo .json, verás que modificarlo y, por lo tanto, traducir el tema a tu idioma local es como editar un archivo de texto estándar y no te supondrá ningún desafío.</span></p>\n<h2 id=\"thepubliithemelanguagefile\"><span>El archivo de idioma del tema Publii</span></h2>\n<p><span>Con este nuevo formato, elementos como el texto de los botones del tema se definen en un archivo de idioma que está separado del código del tema. El formato de estos archivos de idioma es </span><strong><span>themeName.lang.json</span></strong><span> y el archivo se almacenará en la carpeta del tema en la ubicación de los archivos de Publii (esto se define en la Configuración global de Publii). Por lo tanto, si quisiéramos encontrar el archivo de idioma para el nuevo tema Portfolio, primero iríamos a nuestra carpeta de archivos de Publii y luego abriríamos la carpeta </span><strong><span>themes → portfolio</span></strong><span> , donde encontraremos el archivo de idioma:</span></p>\n<figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/27/language-file-publii-theme.png\" alt=\"Archivo de idioma del tema Publii\" width=\"832\" height=\"394\" loading=\"lazy\" data-is-external-image=\"true\"></figure>\n<p><span>Ahora bien, para traducir el texto del tema, técnicamente podríamos simplemente abrir el archivo de idioma y editarlo directamente, pero hay un problema: cuando se actualiza el tema, el archivo de idioma se sobrescribe y se pierden todos los cambios. En cambio, necesitamos una solución más permanente, que Publii ya ofrece.</span></p>\n<p><span>En lugar de editar el archivo directamente, podemos crear una copia del archivo que sea exclusiva para nuestro sitio web, que Publii puede usar para anular el archivo de idioma predeterminado. Veámoslo paso a paso.</span></p>\n<h2 id=\"translatingapubliitheme\"><span>Traduciendo un tema de Publii</span></h2>\n<ol>\n<li>\n<p><span>Primero, ubique el archivo de idioma para el tema que desea traducir; como se mencionó anteriormente, este estará en la carpeta </span><strong><span>Archivos Publii → Temas → NombreDeTema , donde </span></strong><strong><span>Archivos Publii</span></strong><span> es la ruta definida en la opción </span><strong><span>Ubicación de Sitios</span></strong><span> de su Configuración Global de Publii. El nombre del archivo se llamará </span><strong><span>themeName.lang.json</span></strong><span> , donde </span><strong><span>ThemeName</span></strong><span> es el nombre del tema que está usando, por ejemplo, \"portfolio.lang.json\".</span></p>\n</li>\n<li>\n<p><span>Crea una copia del archivo de idioma, dejando el original intacto. Coloca la copia en tu carpeta </span><strong><span>sites/siteName/input/languages , donde </span></strong><strong><span>siteName</span></strong><span> es el nombre de tu sitio tal como se define en Publii (asegúrate de que el nombre del archivo coincida exactamente con el archivo de idioma original). Es posible que tu carpeta </span><strong><span>de entrada</span></strong><span> no tenga una carpeta </span><strong><span>de idiomas</span></strong><span> ; si ese es el caso, simplemente crea la carpeta manualmente y coloca el archivo de idioma dentro.</span></p>\n</li>\n<li>\n<p><span>Abra la copia del archivo de idioma con el editor de texto que prefiera; ¡incluso el Bloc de notas funcionará! Dentro, verá un código; cada línea será una categoría para ordenar el texto que se puede ignorar, o el texto de traducción. El texto de traducción tendrá este formato: </span><strong><span>\"placeHolderText\": \"translatedText\",</span></strong><span> . El texto a la izquierda de los dos puntos es el texto de marcador de posición, que podemos ignorar. El texto a la derecha de los dos puntos es el texto real que aparecerá en el sitio web.</span></p>\n<div class=\"code-toolbar\">\n<pre class=\"language-json\" tabindex=\"0\"><code>{\n   \"partials\": {\n      \"cookiebar\": {\n         \"close\": \"Close\"\n      },\n      \"disqus\": {\n         \"noscript1\": \"Please enable JavaScript to view the\",\n         \"noscript2\": \"comments powered by Disqus.\"\n      },\n      \"menu\": {\n         \"label\": \"Menu\"\n      },\n      \"pagination\": {\n         \"prev\": \"Previous\",\n         \"next\": \"Next\"\n      },\n      \"shareButtons\": {\n         \"shareWithFacebook\": \"Share with Facebook\",\n         \"shareWithTwitter\": \"Share with Twitter\",\n         \"shareWithGooglePlus\": \"Share with Google Plus\",\n         \"shareWithPinterest\": \"Share with Pinterest\",\n         \"shareWithStumbleUpon\": \"Share with StumbleUpon\",\n         \"shareWithLinkedIn\": \"Share with LinkedIn\",\n         \"shareWithBuffer\": \"Share with Buffer\"\n      }\n   },\n   \"slider\": {\n      \"button\": \"View project\",\n      \"slide\": \"Slide %s\"\n   },\n   \"post\": {\n      \"publishedBy\": \"By\",\n      \"publishedOn\": \"Published on\",\n      \"previousPost\": \"Previous Post\",\n      \"nextPost\": \"Next Post\"\n   },\n   \"common\": {\n      \"readmore\": \"View more\"\n   }\n}\n</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a><span>Copiar</span></a></div>\n</div>\n</div>\n</li>\n<li>\n<p><span>Traduce cada fragmento de texto que está a la derecha de los dos puntos; no modifiques el texto de la categoría ni el texto a la izquierda de los dos puntos en cada línea, ya que se utilizan en el código del tema para indicarle a Publii qué texto reemplazar:</span></p>\n<div class=\"code-toolbar\">\n<pre class=\"language-json\" tabindex=\"0\"><code> {\n   \"partials\": {\n      \"cookiebar\": {\n         \"close\": \"Your close button text here\"\n      },\n      \"disqus\": {\n         \"noscript1\": \"Your enable Javascript message here\",\n         \"noscript2\": \"Your Disqus intro text here\"\n      },\n      \"menu\": {\n         \"label\": \"Your menu label here\"\n      },\n      \"pagination\": {\n         \"prev\": \"Your previous button text here\",\n         \"next\": \"Your next button text here\"\n      },\n      \"shareButtons\": {\n         \"shareWithFacebook\": \"Your Facebook share button text here\",\n         \"shareWithTwitter\": \"Your Twitter share button text here\",\n         \"shareWithGooglePlus\": \"Your Google+ share button text here\",\n         \"shareWithPinterest\": \"Your Pinterest share button text here\",\n         \"shareWithStumbleUpon\": \"Your StumbleUpon share button text here\",\n         \"shareWithLinkedIn\": \"Your LinkedIn share button text here\",\n         \"shareWithBuffer\": \"Your Buffer share button text here\"\n      }\n   },\n   \"slider\": {\n      \"button\": \"Your slide button text here\",\n      \"slide\": \"Your slide text here\"\n   },\n   \"post\": {\n      \"publishedBy\": \"Your published by text here\",\n      \"publishedOn\": \"Your publication date text here\",\n      \"previousPost\": \"Your previous post button text here\",\n      \"nextPost\": \"Your next post button text here\"\n   },\n   \"common\": {\n      \"readmore\": \"Your readmore button text here\"\n   }\n}\n</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a><span>Copiar</span></a></div>\n</div>\n</div>\n</li>\n<li>\n<p><span>Una vez que haya reemplazado el texto con su propia traducción o interpretación, guarde los cambios en el archivo. Ahora, cuando Publii cree el sitio web que se cargará, el nuevo archivo de idioma que creó se utilizará para anular las opciones del archivo de idioma predeterminado y verá el texto traducido en su sitio en vivo o en vista previa.</span></p>\n</li>\n</ol>\n<h2 id=\"foradvancedusers\"><span>Para usuarios avanzados</span></h2>\n<p><span>Hay dos cosas que los usuarios más avanzados deben tener en cuenta: no es necesario incluir todo el código del archivo de idioma original en la versión de reemplazo del archivo. En su lugar, puede incluir solo la cadena que desea cambiar. Por lo tanto, si solo deseamos cambiar la etiqueta del botón de la presentación de diapositivas de la página de inicio en el tema Portfolio, podríamos crear un archivo de idioma con el siguiente código dentro:</span></p>\n<div class=\"code-toolbar\">\n<pre class=\"language-json\" tabindex=\"0\"><code>{\n   \"partials\": {   \n      \"menu\": {\n         \"label\": \"Menu\"\n      }\n   },\n   \"slider\": {\n      \"button\": \"View project\",\n      \"slide\": \"Slide %s\"\n   }\n}\n</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a><span>Copiar</span></a></div>\n</div>\n</div>\n<p><span>Esto anulará el texto del botón, dejando el resto intacto. En segundo lugar, es importante tener en cuenta el propósito del texto </span><strong><span>%s</span></strong><span> que se puede ver en algunos textos de traducción, como en el ejemplo anterior; \"diapositiva %s\". El texto </span><strong><span>%s</span></strong><span> representa una variable que se tomará de otra parte de Publii. Por ejemplo, una cadena de texto podría decir \"Bienvenido a mi sitio, de %s\", y en el sitio en vivo, el texto </span><strong><span>%s</span></strong><span> se reemplazará con el nombre del autor, de modo que diga \"Bienvenido a mi sitio, de nombreAutor\". El símbolo </span><strong><span>%s</span></strong><span> representa un número, carácter o cadena de texto que se puede reemplazar por otras variables, por lo que antes de cambiarlas es importante verificar cuál es la variable que se muestra para asegurarse de que su traducción coincida.</span></p>\n<p><span>Puede encontrar más información sobre esto a continuación, en la </span><a href=\"https://getpublii.com/docs/translate-publii-theme-to-another-language.html#variable\"><span>variable %s</span></a></p>\n<h2 id=\"howthejsonlanguagefileworks\"><span>Cómo funciona el archivo de idioma .json</span></h2>\n<p><span>¿Ya has descubierto cómo hacer traducciones, pero te gustaría saber un poco más sobre cómo funciona? ¡Sigue leyendo! En un tema de sitio web estándar, el texto incidental está codificado, oculto en los archivos del tema, lo que dificulta su acceso. Por supuesto, si tienes un pequeño conocimiento práctico de temas o código, entonces es extremadamente fácil cambiarlo directamente en los archivos. Sin embargo, esta no es una solución viable la mayoría de las veces; la persona promedio no tendrá mucho conocimiento sobre codificación, porque no es esencial; ¡por eso existen aplicaciones como Publii, después de todo! En segundo lugar, siempre que se actualicen los archivos del tema, los cambios se sobrescribirán y el texto volverá al valor predeterminado.</span></p>\n<p><span>Por lo tanto, es evidente que se necesita un método más sencillo y fácil de usar para traducir temas. En el caso de Publii, en lugar de codificar texto en los temas, utilizamos un archivo .json de lenguaje, que actúa como una especie de libro de códigos. Básicamente, en lugar de poner texto en el código del tema, pondremos un fragmento de texto de marcador de posición; y en el archivo de lenguaje, definiremos con qué se debe reemplazar cada fragmento de texto de marcador de posición. Luego, cuando Publii crea los archivos para el sitio web, buscará todo el texto de marcador de posición y lo reemplazará con sus respectivas traducciones del archivo de lenguaje. Piense en ello como si estuviera leyendo un fragmento de álgebra; una fórmula como \"x + y = z\" no significa nada por sí sola, pero si define tanto \"x\" como \"y\", entonces se puede calcular la fórmula. En un tema de Publii, \"x\" e \"y\" serían el texto de marcador de posición, que luego se define en el archivo de lenguaje.</span></p>\n<h2 id=\"thelanguagefilestructure\"><span>La estructura del archivo de idioma</span></h2>\n<p><span>La mejor forma de entender el archivo de idioma es echar un vistazo a su contenido. A pesar de la extensión .json, puedes ver el archivo con prácticamente cualquier editor de texto, ¡incluso con el Bloc de notas! Abramos el archivo </span><strong><span>portfolio.lang.json</span></strong><span> , que se encuentra en la carpeta </span><strong><span>Publii → themes → portfolio</span></strong><span> :</span></p>\n<div class=\"code-toolbar\">\n<pre class=\"language-json\" tabindex=\"0\"><code>{\n   \"partials\": {\n      \"cookiebar\": {\n         \"close\": \"Close\"\n      },\n      \"disqus\": {\n         \"noscript1\": \"Please enable JavaScript to view the\",\n         \"noscript2\": \"comments powered by Disqus.\"\n      },\n      \"menu\": {\n         \"label\": \"Menu\"\n      },\n      \"pagination\": {\n         \"prev\": \"Previous\",\n         \"next\": \"Next\"\n      },\n      \"shareButtons\": {\n         \"shareWithFacebook\": \"Share with Facebook\",\n         \"shareWithTwitter\": \"Share with Twitter\",\n         \"shareWithGooglePlus\": \"Share with Google Plus\",\n         \"shareWithPinterest\": \"Share with Pinterest\",\n         \"shareWithStumbleUpon\": \"Share with StumbleUpon\",\n         \"shareWithLinkedIn\": \"Share with LinkedIn\",\n         \"shareWithBuffer\": \"Share with Buffer\"\n      }\n   },\n   \"slider\": {\n      \"button\": \"View project\",\n      \"slide\": \"Slide %s\"\n   },\n   \"post\": {\n      \"publishedBy\": \"By\",\n      \"publishedOn\": \"Published on\",\n      \"previousPost\": \"Previous Post\",\n      \"nextPost\": \"Next Post\"\n   },\n   \"common\": {\n      \"readmore\": \"View more\"\n   }\n}\n</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a><span>Copiar</span></a></div>\n</div>\n</div>\n<p><span>Como podemos ver en el código anterior, hay varios grupos de texto separados por llaves. Cada línea de texto se puede clasificar como uno de dos tipos; ya sea como una categoría o como un marcador de posición con traducción. Se utiliza una categoría para dividir las traducciones en grupos de modo que sean fáciles de encontrar, y cada categoría puede tener subcategorías si es necesario. En el ejemplo anterior, podemos ver que la primera línea es una categoría, </span><strong><span>partials</span></strong><span> , que contiene varias subcategorías; </span><strong><span>cookiebar</span></strong><span> , </span><strong><span>disqus</span></strong><span> , </span><strong><span>menu</span></strong><span> , </span><strong><span>pagination</span></strong><span> y </span><strong><span>shareButtons</span></strong><span> . Es fácil saber cuándo una línea es una categoría, porque solo tendrá una cadena de texto ininterrumpida entre comillas seguida de dos puntos, como </span><strong><span>\"newCategory\":</span></strong><span> . Tenga en cuenta que no es necesario agrupar las traducciones en categorías; es solo una buena práctica para que otras personas que trabajen con el código y las traducciones puedan encontrar fácilmente lo que necesitan.</span></p>\n<p><span>El segundo tipo de contenido es el marcador de posición con traducciones; este es el verdadero meollo del archivo. A diferencia de las categorías, las referencias y traducciones tendrán dos palabras separadas entre comillas, a la izquierda y a la derecha de los dos puntos, de esta manera: </span><strong><span>\"placeholderText\": \"translationText\"</span></strong><span> . El texto a la izquierda de los dos puntos (en este caso, \"placeholderText\"), es el marcador de posición que se ingresará en el código del tema para que Publii lo reemplace cuando cree el sitio web. El texto a la derecha de los dos puntos (\"translationText\"), es el texto que Publii usará para reemplazar el texto del marcador de posición en el sitio web completo.</span></p>\n<h2 id=\"overridinglanguagefile\"><span>Anulación del archivo de idioma</span></h2>\n<p><span>Debido a que los archivos principales del tema se reemplazarán con cada actualización, se agregó una característica adicional para permitir traducciones; </span><strong><span>Overrides</span></strong><span> . Al crear un archivo con el mismo nombre que el archivo de idioma, pero colocándolo en la carpeta </span><strong><span>sites/websiteName/input/languages</span></strong><span> ​​(donde </span><strong><span>websiteName</span></strong><span> es el nombre del sitio como se define en el backend de la aplicación Publii), puede agregar sus propias traducciones que anularán el archivo de idioma, como se describe en la sección de traducción anterior en este artículo. Cuando Publii crea las páginas para su sitio, primero toma el texto de marcador de posición del archivo de idioma, pero luego verifica si hay un archivo de anulación. Si encuentra uno, buscará las cadenas de texto de traducción de reemplazo en el archivo de anulación y las usará para reemplazar el texto que tomó del archivo de idioma. Esto le permitirá modificar el texto sin tener que modificar los archivos principales ni preocuparse por perder sus cambios cuando se realice una actualización.</span></p>\n<h2 id=\"variable\"><span>Variable </span><strong><span>%s</span></strong></h2>\n<p><span>El </span><strong><span>%s</span></strong><span> que a veces ves en el texto es otro fragmento de texto de marcador de posición, pero en este caso obtendrá una variable que puede ser dinámica o modificable. Digamos que un tema tiene un fragmento de texto en la página de inicio que dice \"Hola de parte de la gente de websiteName\", donde websiteName es el nombre del sitio web. Cada usuario que instale este tema tendrá un sitio web diferente, por lo que no pueden simplemente codificar un nombre de sitio web en particular en el tema. En su lugar, usarán un elemento </span><strong><span>%s</span></strong><span> en el archivo de idioma y luego, en el código del tema, definirán cuál debería ser la variable, como </span><strong><span>@website.name</span></strong><span> . De esta manera, cuando Publii crea el código del sitio en vivo, reemplazará automáticamente el </span><strong><span>%s</span></strong><span> con la variable del nombre del sitio web, que será diferente para cada sitio web.</span></p>\n<p><span>Por ejemplo, en la página Etiquetas, en lugar de </span><strong><span>%s,</span></strong><span> coloquemos el número de todas las etiquetas. Para ello, utilizaremos la etiqueta </span><strong><span>{{tagsNumber}} ( </span></strong><a href=\"https://getpublii.com/dev/tags-page-tags/#templatespecific-tags\"><span>https://getpublii.com/dev/tags-page-tags/#templatespecific-tags</span></a><span> ). </span></p>\n<p><span>Archivo de idioma:</span></p>\n<div class=\"code-toolbar\">\n<pre class=\"language-json\" tabindex=\"0\"><code>{\n   \"tags\": {\n\t\t\"pageTitle\": \"Tags\",\n\t\t\"description\": \"Collection of all %s tags\"\t\n   },\n}\n</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a><span>Copiar</span></a></div>\n</div>\n</div>\n<p><span>En el archivo tags.hbs coloque lo siguiente:</span></p>\n<div class=\"code-toolbar\">\n<pre class=\"language-json\" tabindex=\"0\"><code>{{ translate \"tags.description\" tagsNumber }}\n</code></pre>\n<div class=\"toolbar\">\n<div class=\"toolbar-item\"><a><span>Copiar</span></a></div>\n</div>\n</div>\n<p><span>Como resultado obtendremos: \"Colección de las </span><strong><span>5</span></strong><span> etiquetas\", donde 5 es el número de todas las etiquetas disponibles.</span></p>\n</div>",
            "author": {
                "name": "Gabriel Genri"
            },
            "tags": [
                   "Publii"
            ],
            "date_published": "2024-10-11T00:47:45-03:00",
            "date_modified": "2024-10-11T00:47:45-03:00"
        },
        {
            "id": "https://gabrielgenri.github.io/ProyectoWebs/sites-google.html",
            "url": "https://gabrielgenri.github.io/ProyectoWebs/sites-google.html",
            "title": "Sites Google",
            "summary": "Google Sites es una aplicación web que forma parte del paquete Google&hellip;",
            "content_html": "<p>Google Sites es una aplicación web que forma parte del paquete Google Workspace. Te permite crear un sitio web tú mismo sin necesidad de recurrir a un diseñador web, un programador o alguien del departamento de TI de tu empresa.</p>\n<p>Taller <a href=\"https://sites.google.com/view/tallerwebestaticas/SitesGoogle\" target=\"_blank\" rel=\"noopener noreferrer\">Sites Google</a></p>",
            "author": {
                "name": "Gabriel Genri"
            },
            "tags": [
                   "Sites"
            ],
            "date_published": "2024-10-10T23:40:19-03:00",
            "date_modified": "2024-10-10T23:40:55-03:00"
        },
        {
            "id": "https://gabrielgenri.github.io/ProyectoWebs/creacion-de-un-sitio-de-github-pages.html",
            "url": "https://gabrielgenri.github.io/ProyectoWebs/creacion-de-un-sitio-de-github-pages.html",
            "title": "Creación de un sitio de GitHub Pages",
            "summary": "Creación de un sitio de GitHub Pages Publii incluye soporte para páginas&hellip;",
            "content_html": "<header>\n<h1 class=\"post__title\">Creación de un sitio de GitHub Pages</h1>\n</header>\n<div class=\"post__entry\">\n<p>Publii incluye soporte para páginas de Github, que te brindan un espacio para crear un sitio web que puedes usar para destacar tus proyectos de Github o para ti mismo. Desafortunadamente, hay poca funcionalidad para crear un sitio web a menos que tengas algunos conocimientos y estés dispuesto a aprender herramientas difíciles de configurar como Jekyll, pero gracias a Publii podrás crear un sitio web impresionante y con todas las funciones en solo unos minutos, que es muy fácil de actualizar y mantener.</p>\n<p>Crear una página de Github no lleva mucho tiempo, pero hay algunos pasos que debemos cubrir, comenzando con:</p>\n<h2 id=\"generatinganaccesstoken\">Generando un token de acceso</h2>\n<p>Antes de que podamos comenzar a crear una página de Github, necesitamos generar un token de acceso; esto permitirá que Publii obtenga acceso y realice cambios en su página de Github para que pueda crear y editar su sitio web cada vez que haga clic en el botón <strong>Sincronizar</strong> en la aplicación Publii; ¡piense en ello como crear una contraseña que Publii puede usar para ingresar al club Github!</p>\n<p>Generar un token de acceso solo toma unos segundos; solo siga estos pasos:</p>\n<ol class=\"list-spaces\">\n<li>Comience por dirigirse a la <a href=\"https://github.com/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">página principal de Github</a> e inicie sesión en su cuenta; si aún no tiene una cuenta, simplemente haga clic en el enlace <strong>Registrarse</strong> y complete el proceso de registro.\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/signin-3-3.jpg\" alt=\"Iniciar sesión en la cuenta de Github\" width=\"1440\" height=\"900\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n<li>Después de iniciar sesión, abra la configuración de su perfil de Github.\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/github-settings\" alt=\"Configuración del perfil de usuario de Github\" width=\"1456\" height=\"544\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n<li>En la barra lateral izquierda de la pantalla de tu perfil, haz clic en <strong>Configuración de desarrollador.</strong>\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/developer-settings-2-2.png\" alt=\"Configuración de desarrollador de Github\" width=\"1440\" height=\"900\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n<li>En la página de aplicaciones de GitHub, en la barra lateral izquierda, haz clic en la opción <strong>Tokens de acceso personal</strong> y selecciona la opción <strong>Tokens (clásico)</strong> .\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/access-token-2-2.png\" alt=\"Enlace a tokens de acceso personal\" width=\"1456\" height=\"272\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n<li>Ahora estamos en la página de tokens de acceso personal; necesitamos crear uno nuevo para nuestro sitio, así que haga clic en el botón <strong>Generar nuevo token</strong> cerca de la parte superior de la pantalla y seleccione la opción <strong>Generar nuevo token (clásico)</strong> .\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/github-token-2.png\" alt=\"Generar nuevo token\" width=\"1456\" height=\"272\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n<li>En la siguiente pantalla, completa un nombre en la sección <strong>Nota</strong> , por ejemplo, \"Página de GitHub de Publii\". Ahora, en la sección <strong>Seleccionar ámbitos</strong> , agrega una marca de verificación a la opción principal <strong>Repositorio</strong> , que le dará al token acceso a todos los aspectos de la administración de tu repositorio. También puedes establecer una fecha <strong>de vencimiento</strong> para tu token, por ejemplo, \"90 días\", para ayudar a mantener segura tu información. Por último, haz clic en el botón verde <strong>Generar token</strong> en la parte inferior de la pantalla.\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/generate-token-2.png\" alt=\"Nuevo token de acceso personal a GitHub\" width=\"1456\" height=\"2730\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n<li>Ahora volverás a la página de tokens de acceso personal, pero ahora tu nuevo token estará visible en la parte superior de la lista. Hagas lo que hagas, no cierres ni actualices esta página; el token solo estará visible inmediatamente después de su generación. Haz clic en el ícono <strong>Copiar</strong> junto a tu token (mira la imagen a continuación) y cópialo en un lugar seguro, ya que lo necesitaremos al configurar Publii para que funcione con nuestra página de Github.\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/personal-access-token-2.png\" alt=\"Copiar token de acceso personal\" width=\"1456\" height=\"450\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<p class=\"msg msg--highlight\"><strong>Recuerda:</strong> no podrás volver a ver el token, así que asegúrate de guardarlo en algún lugar.</p>\n</li>\n</ol>\n<p>Ahora tenemos un token generado, por lo que podemos crear nuestro sitio web en Publii y darle acceso a nuestra página de Github.</p>\n<h2 id=\"creatingourstaticwebsiteongithubpages\">Creando nuestro sitio web estático en Github Pages</h2>\n<p>Ya tenemos nuestro token de acceso, por lo que esto permitirá a Publii acceder a nuestra página de Github para cargar los archivos del sitio web, pero ahora tenemos que crear el área en Github donde irá nuestro sitio. Regresemos a Github y comencemos:</p>\n<ol class=\"list-spaces\">\n<li>Inicie sesión en Github normalmente, luego haga clic en el ícono más en la barra superior para abrir un submenú; ahora haga clic en la opción <strong>Nuevo repositorio</strong> para ir a la pantalla <strong>Crear un nuevo repositorio</strong> .\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/github-pages-new-repository-2.png\" alt=\"Crear un repositorio en Github\" width=\"1456\" height=\"388\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n<li>En esta pantalla, completa un <strong>Nombre de repositorio</strong> y deja el repositorio como <strong>Público</strong> (las páginas de Github siempre son públicas, incluso cuando el repositorio que las aloja se hace privado). A continuación, haz clic en el botón verde <strong>Crear repositorio</strong> en la parte inferior de la pantalla.\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/create-new-repository-2-2.png\" alt=\"Crear un nuevo repositorio de GitHub\" width=\"1456\" height=\"1700\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n<li>Ahora estamos en la pantalla <strong>de configuración rápida</strong> . Puede que parezca un poco confuso, pero solo tenemos que hacer una cosa sencilla. Hacer clic en el enlace <strong>README</strong> , como se muestra en la imagen siguiente. Esto nos llevará a una pantalla para crear un archivo README.\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/github-pages-quick-setup-2.png\" alt=\"Configuración rápida de páginas de Github\" width=\"1456\" height=\"1799\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n<li>En la pantalla de edición del archivo README, simplemente haga clic en el botón <strong>Confirmar nuevo archivo</strong> . Solo estamos creando este archivo porque su repositorio necesita que se agregue al menos un elemento para crear su rama maestra, donde se guardarán todos sus archivos de Publii. Este archivo creado se eliminará automáticamente la primera vez que Publii se sincronice con nuestra página de Github.\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/commit-new-file-2.png\" alt=\"Confirmar nuevo archivo\" width=\"1456\" height=\"1748\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n<li>Después de confirmar el archivo, volvemos a la lista de archivos; haga clic en la pestaña <strong>Configuración</strong> cerca de la parte superior de la pantalla.\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/github-settings-2.png\" alt=\"Configuración de páginas de Github\" width=\"1456\" height=\"836\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n<li>En la pantalla de configuración, en la barra lateral izquierda, haz clic en <strong>Páginas</strong> ; en la sección <strong>Generación e implementación </strong><strong>,</strong> específicamente en la sección <strong>Rama</strong> , haz clic en la lista desplegable que, por defecto, muestra <strong>Ninguna</strong> y selecciona la rama <strong>principal</strong> de la lista de opciones. Ahora haz clic en el botón <strong>Guardar</strong> para asegurarte de que los cambios se hayan confirmado.\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/main-branch-github-pages.png\" alt=\"Rama principal de Github Pages\" width=\"1456\" height=\"1350\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n<li>Después de guardar, tus páginas de GitHub estarán listas para usarse como un servidor de sitios web estático; para ver tu sitio web, deberás ir a la URL proporcionada en el cuadro de mensaje. A veces, es posible que debas actualizar la página que estás viendo actualmente para ver el cuadro de URL. Por supuesto, tu sitio aún no tiene ningún archivo, pero vamos a cambiar eso.\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/gitHub-pages-url-2.png\" alt=\"URL de páginas de GitHub\" width=\"1456\" height=\"1690\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n</li>\n</ol>\n<p>Y eso es todo en lo que respecta a Github; ahora podemos saltar a Publii para el paso final.</p>\n<h2 id=\"syncingyourpubliistaticsitewithgithub\">Sincronización de su sitio estático de Publii con Github</h2>\n<p>Con todo preparado en Github, podemos actualizar la configuración de conexión en Publii para sincronizar con el repositorio de páginas de Github que acabamos de crear. Primero, abre Publii; si aún no has creado tu sitio web, crea uno y agrega al menos una publicación y asegúrate de haber seleccionado un tema; sin ellos, tu sitio no se creará correctamente.</p>\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/github-pages-configuration-2.svg\" alt=\"Configuración de páginas de GitHub\" width=\"748\" height=\"946\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<p>Ahora haga clic en la opción <strong>Servidor</strong> en la barra lateral izquierda para abrir la pantalla <strong>Configuración del servidor</strong> . Complete los campos con la siguiente información:</p>\n<ul>\n<li><strong>URL del sitio web</strong> : esta será la ruta de su repositorio de Github, que utiliza el formato <strong>\"SU_NOMBRE_DE_USUARIO.github.io/SU_NOMBRE_DE_REPOSITORIO\"</strong> .</li>\n<li><strong>Servidor API </strong> : de forma predeterminada, este campo ya está completado con el servidor API estándar. Sin embargo, si está ejecutando su propia instancia de GitHub, puede cambiar el servidor API ingresándolo aquí.</li>\n<li><strong>Nombre de usuario</strong> : agregue su nombre de usuario de Github aquí.</li>\n<li><strong>Repositorio</strong> : ingrese aquí el nombre de su repositorio de Github (lo configuramos en el paso 2 de la sección Página de Github anterior).</li>\n<li><strong>Rama</strong> - Si ha estado siguiendo nuestra guía, escriba <strong>main</strong> (sensible a mayúsculas y minúsculas) en el campo de texto; los usuarios experimentados pueden querer especificar otras configuraciones como <strong>gh-pages</strong> , <strong>docs</strong> , etc.</li>\n<li><strong>Token</strong> : ¿Recuerdas el token de acceso que guardamos en la primera parte de esta guía? Introdúcelo aquí para que Publii pueda acceder al repositorio.</li>\n<li><strong>Cargas paralelas</strong>  : el valor predeterminado es \"1\". Establece la cantidad de secuencias de carga que Publii puede usar al cargar el contenido de su sitio a GitHub Pages. Los números más altos permiten cargas más rápidas, pero pueden causar errores en conexiones lentas o un error 403 debido a los límites de velocidad de carga de la API.</li>\n<li> <strong>Limitación de velocidad de API</strong>  : deshabilite esta opción solo si está usando Github Enterprise con la limitación de velocidad de API deshabilitada. De lo contrario, deshabilitar esta opción puede provocar errores de implementación.</li>\n</ul>\n<p>Una vez que se hayan configurado todas las opciones, haga clic en el botón <strong>Guardar configuración</strong> para guardar los cambios. Ahora puede ser un buen momento para hacer clic en el botón <strong>Probar conexión</strong> , que comprobará si Publii puede conectarse a su página de Github; si no es así, es posible que algunos de los campos se hayan ingresado incorrectamente.</p>\n<p>Ya está todo listo, así que podemos hacer clic en el botón <strong>Sincronizar su sitio web</strong> en la barra lateral de Publii para comenzar la implementación.</p>\n<p class=\"msg msg--highlight\"><strong>¡IMPORTANTE!</strong> Es posible que el sitio Publii que cargó no sea visible inmediatamente una vez que se haya completado el proceso de sincronización; puede que transcurra aproximadamente un minuto antes de que pueda ver los cambios en su sitio web. Si desea volver a verificar que se hayan aplicado los cambios, puede consultar la sección <strong>Confirmaciones</strong> de su repositorio y marcar el ícono junto a su última confirmación en el área de confirmación:</p>\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/github-commits.png\" alt=\"Botón de confirmación de páginas de Github\" width=\"1456\" height=\"695\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<figure class=\"post__image\"><figure class=\"is-loaded\"><img  src=\"https://getpublii.com/docs/media/posts/25/github-commits-list.png\" alt=\"Lista de commits de GitHub\" width=\"1456\" height=\"558\" loading=\"lazy\" data-is-external-image=\"true\"></figure></figure>\n<p>Si el icono es un punto naranja, significa que se han recibido los cambios, pero aún no se han implementado. Después de una breve espera, se agregarán los cambios.</p>\n<h3 id=\"limitations\">Limitaciones</h3>\n<p>La implementación del soporte de Github Pages en Publii tiene dos limitaciones en la iteración actual:</p>\n<ul>\n<li>No es posible cargar un sitio web con más de 1000 archivos, aunque este límite se incrementará a aproximadamente 5000 archivos en versiones posteriores. Este límite es lo suficientemente alto para la gran mayoría de los sitios web, pero es bueno tenerlo en cuenta en caso de que esté ejecutando un proyecto de sitio web muy grande a través de Publii.</li>\n<li>La API de Github está limitada a 5000 solicitudes por hora; Publii te informará si tu límite de solicitudes es demasiado bajo para completar la implementación o sincronización de tu sitio web. Este límite también se aplica si una sincronización tiene más de 5000 cambios a la vez; en este caso, debes sincronizar tu sitio web con regularidad para evitar acumular demasiados cambios.</li>\n</ul>\n<h2 id=\"someusefultipsandtricks\">Algunos consejos y trucos útiles</h2>\n<p>¿Quieres tener un poco más de control sobre tu sitio? Aquí tienes algunos trucos útiles que te ayudarán a que tu sitio quede exactamente como quieres:</p>\n<h3 id=\"simplifyyourwebsiteurltoyourusernamegithubio\">Simplifique la URL de su sitio web a yourusername.github.io</h3>\n<p>De forma predeterminada, la URL de su página de Github será <strong>username.github.io/repository-name</strong> , pero podemos simplificarlo creando un repositorio para nuestro sitio web llamado <strong>yourusername.github.io,</strong> por ejemplo, si mi nombre de usuario es TestName, crearía un repositorio llamado <strong>TestName.github.io</strong> .</p>\n<p>Luego, en lugar de duplicar la URL como TestName.github.io/TestName, Github simplificará la URL a <strong>TestName.github.io</strong> únicamente.</p>\n<h3 id=\"useacustomdomain\">Utilice un dominio personalizado</h3>\n<p>Si prefieres usar tu propio nombre de dominio en lugar del subdominio predeterminado github.io, Publii creará automáticamente el archivo CNAME con tu nombre de dominio personalizado que buscan las páginas de Github.</p>\n<p>Antes de hacer esto, deberá configurar su dominio utilizando el tercer paso de este <a href=\"https://help.github.com/articles/quick-start-setting-up-a-custom-domain/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">tutorial de dominio personalizado de Github</a> ; si necesita más ayuda, los consejos incluidos en <a href=\"https://help.github.com/articles/setting-up-an-apex-domain/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">este artículo de configuración de dominio</a> le ayudarán.</p>\n<h3 id=\"issslavailableforyourcustomdomain\">¿Está SSL disponible para su dominio personalizado?</h3>\n<p>Todos los subdominios de github.io tienen SSL habilitado de forma predeterminada, también el HTTPS es compatible con las páginas de Github que tienen dominios personalizados.</p>\n<h3 id=\"usedifferentbranchesinyourrepo\">Utilice diferentes ramas en su repositorio</h3>\n<p>En nuestro tutorial, usamos específicamente la rama maestra de nuestro repositorio, pero usted es libre de usar otras ramas; por ejemplo, podría crear un sitio web de documentación para su repositorio existente usando una rama de documentación. Simplemente cree una rama adicional y configure esta nueva rama como su fuente de páginas de Github en su configuración de Github.</p>\n<p class=\"msg msg--highlight\"><strong>¡IMPORTANTE!</strong> Si utiliza una rama diferente de la rama maestra para su sitio web de Github Page, asegúrese de cambiar el nombre de la rama en la configuración de Publii. Si la deja como \"maestra\" y luego sincroniza su sitio web, Publii eliminará todos los archivos existentes de su rama maestra.</p>\n</div>",
            "author": {
                "name": "Gabriel Genri"
            },
            "tags": [
                   "Publii"
            ],
            "date_published": "2024-10-10T23:30:20-03:00",
            "date_modified": "2024-10-11T00:03:45-03:00"
        }
    ]
}
